101 32
97 32
111 32
115 32
13 10
44 32
101 110
113 117
101 114
101 115
97 110
263 256
100 256
111 110
97 114
101 108
121 32
111 114
111 259
97 108
195 173
97 100
108 257
262 32
111 115
97 259
271 32
97 98
97 115
100 105
111 261
265 116
195 179
99 105
269 32
117 110
262 116
101 259
97 261
195 161
105 110
195 169
128 148
226 298
115 117
99 104
99 117
100 258
109 105
273 32
114 101
260 260
111 109
110 258
115 256
100 101
111 116
108 274
288 32
97 109
108 256
108 258
59 32
266 116
118 105
266 32
101 261
115 105
195 177
264 32
270 32
97 260
115 101
46 32
99 290
116 105
108 281
112 270
114 105
99 308
276 257
112 305
46 307
110 32
116 111
299 32
112 117
275 32
108 101
117 105
99 269
300 32
100 265
114 97
111 260
114 257
109 256
44 260
258 268
101 100
97 99
275 108
263 105
280 261
109 117
111 108
257 268
265 112
266 301
98 105
104 283
81 345
100 290
101 260
115 116
112 114
98 114
109 295
100 282
367 106
375 312
258 267
276 32
83 364
108 105
100 277
99 283
116 262
335 258
285 106
297 32
291 32
102 117
116 117
368 376
103 117
284 261
112 264
115 296
265 261
328 324
101 109
266 303
116 114
264 257
112 273
97 263
277 258
373 259
110 105
108 32
340 100
338 341
112 111
323 32
266 100
98 117
121 258
116 256
117 287
101 99
118 264
112 105
108 108
291 257
304 32
114 32
103 114
288 339
311 260
317 267
109 264
115 111
286 272
257 278
103 258
100 111
114 363
257 267
104 105
109 266
121 260
263 369
433 269
312 114
97 116
295 32
280 260
257 272
268 278
100 117
195 186
97 324
405 32
382 357
263 322
121 261
99 284
100 269
258 272
318 272
294 272
285 314
283 257
101 122
275 103
307 341
116 321
108 344
385 258
267 309
262 289
333 257
450 264
104 356
101 301
118 415
97 103
297 406
99 355
264 116
99 97
109 101
99 280
394 32
108 327
262 303
112 284
299 261
372 256
97 289
291 116
262 100
396 273
108 117
99 273
401 267
265 256
439 458
360 301
118 292
427 475
194 191
115 264
100 274
97 106
271 260
115 325
58 32
366 336
300 259
340 303
266 122
58 462
279 278
102 105
109 258
112 262
292 256
97 122
261 272
299 465
271 278
97 304
379 258
284 260
279 282
111 98
115 283
286 267
116 319
97 329
271 108
118 262
99 270
288 110
264 290
121 257
287 257
381 32
292 114
273 105
105 109
299 494
365 279
295 110
100 264
277 257
115 275
116 349
281 268
311 106
274 268
289 110
390 101
118 361
68 105
100 257
99 111
311 289
390 256
97 318
472 351
109 111
274 272
346 116
99 334
262 260
258 257
379 111
101 103
99 315
276 321
287 256
396 305
116 257
109 262
270 105
104 117
264 110
270 290
297 110
194 161
104 97
349 122
89 32
265 302
111 329
99 306
287 258
109 280
371 111
412 262
112 306
333 416
497 32
407 274
294 267
101 289
293 267
263 386
281 272
117 114
112 334
302 398
331 262
104 257
105 259
264 258
276 261
104 273
409 100
117 115
99 101
264 114
105 114
111 318
46 260
111 99
63 32
319 256
388 256
109 275
98 270
111 106
104 264
454 268
447 339
105 100
101 116
97 121
112 269
263 355
97 112
464 103
285 301
282 302
358 279
464 118
277 273
97 291
304 114
108 293
101 106
101 324
513 115
111 353
261 267
100 276
311 98
277 32
99 319
393 258
285 115
380 99
109 276
293 268
112 275
265 257
115 258
297 339
281 267
97 353
257 347
409 99
284 256
461 291
285 289
108 443
296 103
104 256
78 258
397 112
360 272
104 357
265 260
114 117
110 274
388 264
118 325
280 105
342 101
114 258
109 292
478 106
118 117
293 272
110 415
100 280
419 315
267 310
385 111
109 265
100 270
567 296
98 306
118 275
284 378
115 260
304 292
283 321
328 260
101 118
470 325
295 339
274 267
555 422
115 361
394 258
105 422
344 260
275 116
100 326
271 313
402 282
428 485
311 99
285 99
277 286
104 308
312 351
314 257
116 308
104 471
115 290
359 272
108 270
636 267
118 101
579 272
256 268
102 296
110 117
322 272
109 291
112 277
412 279
687 509
304 115
358 264
297 108
116 264
109 257
99 257
258 279
287 442
109 343
116 273
114 111
105 303
117 108
268 347
116 343
268 313
97 118
97 338
104 284
558 591
342 293
102 273
371 265
109 378
33 32
280 258
285 103
490 103
423 266
283 114
115 378
101 431
302 292
98 108
402 378
302 343
478 285
110 350
320 100
103 105
284 605
331 668
363 264
417 381
348 101
320 370
106 117
302 114
112 101
262 647
111 338
97 408
80 508
116 275
39 39
100 286
112 448
300 260
104 269
97 606
257 313
357 378
115 269
118 296
111 122
277 274
333 116
271 105
115 386
115 261
536 256
256 267
390 322
276 294
354 278
276 110
103 487
328 103
108 521
342 287
349 289
300 271
435 106
112 108
621 586
297 114
304 259
370 537
111 289
59 260
435 821
306 112
531 261
440 258
266 260
287 459
302 319
257 374
302 275
65 110
115 331
257 257
262 122
582 542
110 111
295 259
104 362
379 286
116 270
295 114
99 288
297 603
69 339
380 372
105 32
109 269
287 286
389 114
97 496
264 261
82 111
65 32
104 321
601 256
81 117
111 408
356 283
309 310
263 264
114 265
111 276
115 271
407 281
116 258
97 301
117 351
109 626
116 315
89 261
402 518
277 105
277 305
110 665
389 32
589 810
318 452
423 321
276 323
270 109
114 280
102 315
550 484
728 698
194 187
115 356
276 327
68 746
519 292
440 274
890 549
100 262
893 101
97 331
284 105
330 278
314 282
432 316
306 289
401 260
360 106
99 271
619 98
392 272
383 103
358 323
588 257
383 336
256 272
346 260
99 265
115 292
565 484
297 259
267 316
270 310
460 32
520 786
319 293
684 256
289 271
280 329
118 258
266 261
279 347
326 257
97 456
265 562
262 285
267 282
270 261
105 391
297 370
417 535
263 101
489 257
333 414
551 320
287 281
315 274
412 115
424 268
469 258
428 272
103 814
380 103
552 274
302 264
490 765
264 286
555 114
116 447
319 322
391 270
102 264
752 571
313 267
277 294
383 431
110 308
523 575
461 623
257 279
108 350
112 487
315 514
315 273
266 99
326 268
103 963
270 114
97 335
80 117
97 117
315 292
330 282
287 105
371 296
580 269
599 427
680 305
109 296
677 268
359 267
348 302
103 345
109 270
103 266
109 274
440 281
435 122
391 370
117 100
100 114
607 114
383 325
262 103
264 321
102 114
342 285
304 116
267 413
104 270
99 275
101 329
116 397
446 263
284 329
97 387
112 676
461 420
69 406
277 354
382 460
731 114
649 584
838 301
287 117
472 114
262 261
99 264
279 332
519 103
103 275
112 265
258 282
362 278
337 278
109 273
342 355
344 118
366 108
287 274
100 271
109 411
268 332
681 271
99 266
109 369
111 102
108 111
310 316
105 482
335 836
366 568
366 325
68 256
410 309
660 258
97 399
99 361
395 272
314 278
296 116
100 502
538 473
291 258
111 121
277 281
491 116
479 257
825 650
365 656
453 331
526 258
100 336
105 98
342 395
288 310
314 268
267 352
100 273
333 594
102 707
561 292
100 534
389 320
436 400
111 456
287 283
118 416
115 288
337 282
97 320
256 257
470 264
99 543
844 512
275 109
258 374
267 278
100 361
98 334
854 549
326 278
279 313
402 271
270 260
280 318
1058 296
574 365
1033 319
111 272
284 353
499 320
393 796
69 370
276 389
103 111
292 306
287 114
454 260
275 260
383 289
266 289
106 487
97 423
299 1064
381 258
358 656
285 258
358 116
101 423
499 442
265 105
331 264
302 108
100 294
592 313
360 476
63 462
715 485
275 99
101 318
277 271
834 266
761 326
388 400
264 414
371 308
446 640
99 258
283 501
288 260
109 277
674 122
562 1138
511 289
524 325
104 486
101 304
98 580
334 370
486 424
793 257
97 391
397 274
306 296
348 342
399 293
404 268
346 323
586 399
830 258
105 289
112 355
257 421
267 279
980 289
435 289
288 261
77 364
883 399
112 471
105 419
109 112
269 99
309 352
641 891
479 281
118 798
954 32
292 488
653 763
326 279
109 281
269 268
572 287
871 1065
273 100
681 654
529 103
688 512
354 313
300 609
467 257
505 268
69 115
257 633
291 260
286 330
292 105
268 421
454 99
544 105
265 279
346 822
98 501
280 353
756 292
289 476
551 487
320 262
328 257
358 604
495 281
683 678
469 274
257 332
115 266
102 275
477 608
1084 317
683 114
304 406
852 598
89 258
286 337
83 848
84 523
1114 376
97 504
302 1052
495 257
264 260
558 497
607 336
342 585
1161 916
104 32
265 329
309 316
401 466
943 99
285 110
118 467
300 121
264 294
282 267
65 108
1110 317
103 334
116 286
811 623
304 260
736 261
101 353
335 350
333 331
903 325
300 913
265 258
373 694
734 512
80 305
333 434
423 411
326 282
336 268
762 268
299 329
403 272
541 922
388 493
559 303
285 114
264 269
545 116
418 262
109 397
273 312
572 274
109 97
264 280
106 315
65 764
84 111
118 919
110 416
116 305
577 900
436 258
397 371
257 387
112 473
257 757
287 306
495 258
320 114
730 432
97 613
99 610
498 858
67 519
105 103
295 603
809 300
491 515
320 258
539 915
1120 314
284 318
118 257
267 410
715 372
428 372
491 114
559 122
293 278
439 285
270 386
118 274
266 115
277 637
334 98
108 262
110 97
270 442
313 620
297 115
109 361
344 103
411 319
284 116
80 604
323 303
402 709
67 290
99 108
1111 365
300 694
334 99
109 441
424 272
279 267
76 312
105 116
511 114
100 528
108 763
380 98
351 272
306 99
1348 573
83 640
1135 508
975 293
1012 98
110 291
779 258
1232 280
108 278
1119 277
679 322
115 280
346 614
105 292
999 448
473 273
108 295
257 317
362 347
993 258
399 1145
269 105
106 598
280 338
295 98
297 260
1282 537
1009 265
101 120
517 282
118 614
101 331
411 286
101 338
394 377
260 67
833 865
70 575
373 115
300 115
304 108
265 353
328 106
292 931
407 257
112 271
1183 32
110 874
97 302
67 270
792 114
1328 391
712 276
1329 851
866 332
404 267
587 102
256 278
277 350
342 476
539 282
317 769
258 310
110 286
109 286
98 441
392 267
296 1116
495 274
122 32
632 343
110 312
67 117
316 733
1185 325
270 352
472 678
258 330
469 276
322 267
275 261
100 569
349 324
908 264
395 267
288 316
342 655
627 325
730 303
299 318
270 257
554 304
727 32
1305 386
262 432
453 105
287 326
348 268
388 532
273 261
412 114
393 286
314 279
275 1366
731 306
108 294
272 268
261 570
280 257
672 289
300 112
105 115
323 1295
262 1153
330 347
110 280
629 1253
1391 1472
307 1473
306 770
103 108
293 282
737 984
311 1478
108 317
256 282
262 969
112 801
401 451
419 262
291 327
362 332
100 281
517 885
719 258
856 268
100 32
326 272
335 790
346 1398
445 1174
111 484
645 726
1178 380
270 269
541 900
121 353
283 294
358 400
519 431
962 485
112 280
333 327
76 257
292 1179
285 303
269 116
286 492
285 532
599 109
331 114
1193 591
97 484
526 257
320 553
417 115
1483 423
283 316
529 336
507 282
752 116
354 347
1287 839
389 925
267 268
275 431
517 550
98 361
269 293
118 287
683 351
258 425
291 274
99 256
368 1393
270 116
306 609
1361 739
309 725
110 566
104 473
371 676
262 105
797 105
775 258
351 268
557 452
99 722
1235 258
98 868
348 947
972 635
629 280
99 277
320 482
111 1451
389 259
111 615
111 112
1083 293
456 774
328 680
346 399
582 301
283 108
287 696
284 408
111 504
342 323
498 596
411 350
329 581
787 293
289 117
539 550
101 285
539 565
311 261
195 137
313 500
561 351
496 598
102 108
98 614
813 377
101 408
105 381
391 114
103 286
587 118
544 705
329 68
281 257
103 514
264 327
121 482
1555 1177
852 869
86 105
97 615
631 286
743 110
300 365
1595 471
1283 101
1003 646
267 313
323 260
480 446
366 114
309 317
382 275
355 646
114 262
330 332
68 1610
270 316
265 322
691 261
578 79
517 565
358 655
276 266
58 307
446 114
373 803
489 261
294 492
601 279
116 828
320 118
523 948
577 922
345 289
441 306
257 282
744 103
58 260
513 281
272 257
257 310
108 508
271 332
876 420
1017 256
106 1639
101 98
644 281
315 258
987 1095
286 452
320 115
77 611
436 274
97 105
277 359
530 103
403 279
276 303
275 1125
99 441
283 105
108 296
102 750
101 102
355 114
295 405
590 325
572 359
258 384
777 264
407 430
382 114
735 256
663 482
411 616
331 610
1468 256
870 305
99 262
470 256
535 268
340 260
262 320
114 308
627 264
117 109
276 260
366 889
287 700
265 318
539 885
280 408
649 333
342 108
650 467
100 398
311 122
294 268
257 426
348 631
894 105
97 800
330 474
291 281
46 46
100 308
286 384
567 112
515 312
272 278
295 331
115 896
319 395
1301 389
277 261
712 336
108 277
273 293
1405 1707
1372 1254
116 1155
631 258
306 103
268 481
453 848
323 114
477 117
294 330
76 608
1735 549
551 675
309 802
109 448
881 109
279 421
275 122
97 104
317 438
529 705
100 325
1718 115
950 112
1190 325
300 1141
284 279
117 289
580 424
1046 717
930 365
530 116
118 271
1360 316
99 672
905 264
1062 265
277 444
515 32
84 264
256 279
574 98
258 337
389 109
566 286
285 431
1214 646
366 264
276 527
385 377
864 303
1558 292
69 110
399 281
429 267
366 845
394 260
108 614
1289 303
286 310
121 350
344 121
117 349
895 831
649 781
257 506
556 1496
446 267
590 256
302 1499
577 432
974 790
693 384
832 293
499 336
528 294
110 486
299 504
360 1113
264 460
483 743
653 283
276 457
587 781
923 258
111 613
773 103
350 267
1747 102
283 357
1128 351
287 538
99 357
405 260
1020 320
833 116
1042 901
76 101
100 531
257 330
283 334
258 309
286 309
1206 518
477 112
1353 476
435 100
1129 112
579 533
105 122
294 452
33 307
365 476
403 257
937 353
319 595
305 268
67 1814
116 274
393 116
100 459
264 289
310 352
843 269
80 952
479 434
346 304
275 98
257 337
110 277
363 486
811 345
1350 109
100 287
323 108
275 278
1189 310
76 1334
275 283
381 261
279 387
306 272
112 1056
989 1086
612 452
554 103
327 268
287 1438
451 337
195 188
1469 103
663 1450
1352 635
115 515
419 273
303 272
257 309
517 915
526 377
295 260
281 374
817 1717
1733 331
257 425
639 1846
551 417
363 280
1542 365
294 309
1137 616
66 105
384 410
103 292
469 286
496 869
903 264
294 449
418 116
118 256
294 337
380 109
275 293
346 663
97 307
83 117
399 117
271 317
436 264
258 316
344 122
100 315
618 257
1269 293
780 370
858 256
354 332
264 108
1069 257
628 314
1739 266
997 336
1617 317
80 270
1096 955
323 482
285 493
491 334
330 313
311 102
112 501
1399 695
665 1548
878 314
109 573
1905 418
115 322
267 293
1099 332
98 284
515 448
262 302
109 319
111 372
286 466
1342 575
399 284
68 290
105 803
379 525
755 122
294 310
398 257
270 336
97 608
277 377
727 261
881 512
956 100
285 283
409 542
273 894
100 350
1510 293
293 257
1788 1363
280 274
819 269
972 875
849 116
1895 279
530 110
112 416
97 102
112 291
526 281
286 449
97 611
110 273
607 325
589 289
100 474
316 505
324 257
314 272
267 474
811 291
69 655
648 309
306 261
767 970
473 349
109 271
99 294
371 287
286 268
344 106
531 260
1625 1242
275 311
275 105
267 332
297 261
302 351
90 273
1474 88
265 408
974 111
780 679
362 313
338 887
621 436
1091 514
277 429
488 114
662 274
111 301
366 1045
108 266
576 257
337 313
762 1703
530 114
538 401
1192 279
632 349
470 336
326 332
590 853
419 266
110 543
383 996
270 108
1200 790
832 261
578 65
264 309
713 256
117 271
1018 116
363 319
296 105
106 270
1306 278
855 426
456 410
1142 1387
323 988
411 921
1075 314
100 429
677 303
361 320
356 476
99 114
334 115
323 103
97 1644
70 296
1171 418
100 386
257 534
432 329
289 424
294 278
819 984
116 2069
815 256
100 448
265 286
73 73
975 395
287 1105
337 332
103 262
99 286
315 98
335 1581
783 635
267 257
83 1325
80 273
542 471
288 405
330 387
272 282
263 610
300 370
277 1189
427 416
645 501
115 308
109 537
1164 542
264 759
108 332
397 98
606 257
310 278
1247 264
336 267
1036 616
103 361
104 281
358 122
554 773
366 105
1859 467
104 1944
118 270
310 317
294 384
265 369
284 338
712 722
306 116
973 284
102 319
818 257
730 789
1066 419
1281 115
1545 822
352 602
393 105
302 541
296 370
328 112
258 343
632 1436
101 414
121 286
311 365
258 278
818 869
293 374
311 404
263 296
1726 109
1039 118
1019 256
341 267
363 275
578 111
97 758
1699 441
1291 1127
1331 274
305 272
303 268
285 422
97 623
962 372
432 1987
535 272
755 116
788 329
2062 1459
776 508
403 282
103 1204
1040 115
702 267
662 281
279 569
429 309
755 109
277 583
457 309
98 111
342 303
559 320
688 738
314 343
103 357
1197 458
1766 258
830 274
270 103
118 97
843 1533
350 268
552 359
273 260
97 950
264 256
97 823
262 115
499 260
1889 289
283 580
417 331
1876 509
504 788
562 277
279 502
1021 281
111 1150
346 388
1002 400
330 507
1066 1480
100 443
295 261
349 118
1032 257
920 257
112 488
1515 400
283 266
344 391
1471 892
304 499
98 273
483 326
33 261
258 468
1995 320
777 261
263 639
112 361
286 282
328 391
269 395
360 114
884 759
556 272
1619 566
98 269
97 509
545 336
574 1332
1547 988
632 351
98 264
524 105
276 828
98 262
541 432
685 321
302 533
112 629
863 361
1032 279
1427 1167
1878 424
590 805
1820 1377
1365 594
418 114
258 437
109 322
274 374
409 485
353 272
780 122
337 347
840 503
257 348
1016 257
340 99
365 262
265 338
1951 376
1103 400
263 640
645 1271
1241 268
736 260
527 581
1152 488
265 281
318 267
315 256
967 258
286 480
524 336
275 738
383 105
1526 434
428 317
326 313
315 305
257 481
1602 325
1318 296
587 418
279 534
287 327
105 514
1021 327
111 758
274 257
397 393
1322 288
104 315
782 2269
295 108
407 350
262 1304
309 293
268 387
2147 1242
358 842
360 1141
507 426
453 257
441 292
285 957
100 359
526 274
862 336
390 729
337 309
116 369
997 442
302 700
267 317
453 116
102 101
328 603
1252 331
2325 323
760 110
118 979
544 116
98 528
1357 305
973 620
1640 320
1096 616
328 584
418 256
106 97
609 98
296 727
620 274
401 438
295 115
287 398
284 276
279 420
2326 1074
400 282
479 657
278 267
1540 398
734 109
1299 301
1005 386
734 738
1020 285
677 767
104 1105
292 293
377 310
294 480
679 611
1246 326
409 625
104 327
384 282
396 275
277 392
436 359
824 257
116 334
279 474
837 258
561 296
2091 292
1584 370
335 325
1171 653
2235 1168
496 264
348 112
112 288
551 118
544 995
1039 116
500 268
876 291
2108 442
413 352
319 934
447 110
377 309
1669 273
328 321
306 100
276 259
67 2120
851 98
477 276
346 99
379 429
1281 655
1220 1335
1206 528
634 326
1409 343
541 684
329 76
488 286
294 437
1614 553
102 486
981 293
300 640
2027 116
100 321
332 267
318 648
2246 1752
348 262
384 317
1842 264
292 322
355 277
277 334
1197 285
334 263
80 355
713 279
1215 256
588 274
522 815
111 118
83 101
384 310
478 331
451 279
320 639
976 1292
934 275
329 1049
284 322
2259 103
775 377
495 868
383 745
908 400
330 267
692 2098
1233 256
108 284
488 350
294 279
1868 419
365 1022
722 103
383 264
1137 319
1394 643
761 270
1403 256
257 1430
278 268
418 293
97 624
314 347
703 381
354 421
306 1212
651 286
331 289
1568 573
424 267
82 105
1342 2040
393 300
901 365
541 261
1886 99
100 392
77 105
112 326
102 801
524 256
294 754
760 286
800 322
338 872
691 118
711 282
413 309
320 532
477 1902
280 456
63 307
1099 426
264 293
326 267
1307 1982
588 281
279 518
285 919
310 685
394 331
321 272
108 441
1285 493
121 327
447 108
342 534
275 619
270 331
270 414
286 437
111 302
320 292
1080 267
316 547
277 304
907 354
630 314
377 316
194 171
498 367
531 516
356 264
1142 625
262 690
283 327
102 334
718 326
99 312
276 339
104 546
103 577
716 479
425 278
314 330
356 284
328 1700
421 570
340 329
528 266
490 1425
349 329
257 437
477 106
627 103
289 292
109 473
930 98
114 296
106 608
67 288
479 116
920 294
104 295
483 314
77 270
282 268
2008 2464
626 117
77 573
479 1768
1456 108
277 612
1047 268
263 1381
599 265
1421 357
669 540
306 1001
110 1125
511 391
270 334
876 623
346 102
287 369
108 276
348 728
268 426
304 422
285 948
273 1247
897 380
347 315
377 282
884 280
348 870
690 258
864 422
396 343
368 2251
408 667
862 325
68 276
286 257
688 109
1096 319
715 691
300 475
65 263
344 399
306 1026
907 257
501 262
815 279
279 506
1027 277
2583 573
274 445
98 271
77 1512
622 310
77 117
291 1196
270 328
371 523
419 264
881 738
101 372
264 351
103 1874
111 316
331 32
966 267
357 442
1009 654
102 665
327 278
1367 566
500 272
935 256
1079 493
629 101
116 306
267 533
257 474
1668 501
1034 326
579 431
302 413
98 265
285 116
371 995
264 343
67 269
327 267
466 310
67 108
291 100
390 369
277 362
106 101
257 556
383 568
1172 532
1823 268
83 319
289 114
940 314
33 462
1089 1059
363 594
982 258
344 301
279 710
262 620
65 114
302 295
257 468
330 506
825 280
366 722
1670 416
268 506
574 436
389 351
63 260
295 289
348 261
1392 512
343 382
1712 256
876 1059
293 426
584 325
467 294
1226 274
331 109
74 117
886 258
279 528
265 296
2612 2693
66 2584
314 267
306 121
536 2080
1806 351
1318 265
97 1133
257 293
276 926
114 284
267 337
486 944
115 276
450 286
300 418
257 418
451 384
100 297
336 272
429 282
470 279
441 334
100 536
432 99
346 798
114 345
118 321
257 569
317 268
477 121
320 320
365 563
370 334
1279 261
1789 115
1831 461
283 362
1193 497
70 934
689 352
97 414
953 261
262 99
362 421
1910 106
270 306
490 566
2381 323
727 1459
368 76
2106 112
1152 482
283 926
344 1664
498 667
630 717
703 32
265 346
100 709
281 425
1564 2045
284 456
356 280
100 444
291 105
451 723
1409 275
402 605
109 514
460 257
348 418
264 105
97 561
118 359
1395 641
602 1338
1086 115
280 758
1386 293
109 605
258 430
1238 261
1561 424
115 605
294 410
783 977
474 310
448 874
294 704
386 257
104 361
692 1369
67 105
1008 1286
306 957
1535 624
2552 2470
459 282
286 279
2608 1692
547 971
405 324
315 359
545 106
277 560
277 327
278 1383
524 114
304 694
1310 424
277 548
100 261
84 1155
89 257
264 340
342 324
1103 493
1567 921
457 282
334 488
517 2029
2523 656
1309 278
300 476
2411 380
929 774
111 509
413 946
111 823
468 596
583 581
1615 442
323 419
1019 322
428 278
1371 257
115 319
108 322
453 294
870 273
447 98
468 282
674 256
268 503
489 293
258 438
276 391
454 904
306 412
1291 265
938 895
1764 654
1830 646
121 271
330 420
313 268
737 105
1822 269
565 509
489 395
792 979
1194 508
1500 261
101 571
268 420
577 1094
844 108
943 530
626 995
457 267
277 2195
274 437
398 282
1238 1463
716 1290
587 2742
1214 277
974 625
770 257
778 354
1476 537
264 281
428 691
326 343
346 289
937 372
469 336
110 356
371 280
271 257
574 1396
1107 289
258 449
277 114
297 328
296 414
306 275
460 261
311 109
315 266
2844 573
302 698
293 445
286 258
97 417
332 882
2178 270
2611 1914
578 86
1395 2253
914 105
299 456
1207 314
80 264
99 448
1107 422
1803 546
400 278
689 316
466 316
843 865
628 576
264 362
522 1302
692 305
257 503
1851 431
286 278
1401 101
1396 1119
766 362
1732 118
590 336
101 456
118 266
579 121
264 112
383 285
84 308
896 118
451 410
265 456
283 430
334 103
809 289
86 415
724 2890
257 420
348 783
2843 122
296 446
371 2939
279 481
280 504
307 68
82 101
83 378
849 105
46 887
761 933
677 98
2700 707
402 502
100 941
1848 310
1720 1492
795 257
384 278
1925 503
112 486
2427 678
617 257
2298 509
529 568
645 256
320 32
744 285
103 798
277 430
102 345
100 327
1186 281
116 537
287 403
274 425
546 313
1466 650
335 111
279 257
330 1236
1129 116
323 391
118 280
279 507
281 445
80 1671
67 315
97 1001
83 105
314 387
349 116
1579 381
613 341
2663 2016
1535 745
294 258
257 438
498 1122
716 1063
1020 925
282 570
1288 293
294 466
360 437
497 293
286 754
294 257
447 323
1168 515
302 301
692 292
407 443
645 279
491 269
77 281
1107 114
121 264
286 316
1317 293
380 485
411 326
109 460
1670 625
761 971
320 501
68 69
488 264
996 2841
854 3032
103 441
270 1327
268 71
315 262
407 750
275 571
1678 264
905 604
2065 2249
2807 256
3043 2733
2399 476
618 1167
615 498
1171 112
3048 343
76 274
945 1681
547 270
371 585
320 2033
122 111
118 2018
2322 2542
1279 260
397 548
930 116
480 267
680 273
109 3012
344 509
1042 1355
590 264
507 317
936 267
689 386
109 297
65 1147
744 311
112 321
617 282
276 557
111 103
1428 398
284 504
392 309
257 753
532 257
268 507
302 1837
100 1035
287 386
257 258
446 108
711 278
257 343
274 279
409 691
483 1292
66 280
467 434
847 548
118 111
1844 296
426 316
2339 1349
112 1763
118 1105
674 321
1137 955
258 293
1128 349
345 422
1222 423
483 105
1352 875
285 292
584 121
388 476
1118 564
279 850
1680 850
455 282
1069 321
956 708
1218 1565
459 257
977 322
277 642
670 270
599 654
627 996
519 370
105 553
344 325
105 694
641 459
306 122
104 296
467 362
416 325
477 325
976 743
70 114
2245 271
582 115
276 281
1764 265
286 704
257 675
379 350
389 118
352 278
283 638
1547 391
102 896
1357 1455
1471 440
1498 503
1608 422
411 955
418 458
621 1294
439 1746
1066 103
782 2154
397 619
272 309
612 648
315 333
80 306
3164 810
270 516
385 493
310 505
101 504
2390 260
264 354
1220 2052
770 258
267 400
98 1336
528 359
658 272
400 272
295 803
392 449
666 631
2058 297
99 291
486 826
436 1250
287 273
538 756
102 471
536 326
294 282
393 1746
268 267
2842 332
477 122
453 362
2945 2727
2084 424
1023 99
296 320
1040 2087
2899 934
338 581
2046 644
1164 431
1043 781
100 293
1574 532
111 624
1213 258
1973 448
1147 114
278 772
776 326
114 801
121 354
666 1775
496 266
439 542
545 256
2294 591
511 1593
552 560
547 314
483 403
257 592
1597 1861
417 310
283 527
536 314
767 266
100 508
1384 2128
982 377
280 879
368 71
2669 406
100 801
116 354
817 515
1056 292
496 1787
1319 325
76 117
451 600
348 409
377 352
309 278
353 267
2418 826
100 518
317 1674
346 511
109 308
393 460
104 275
101 391
407 359
1088 260
328 1593
97 333
488 325
511 99
66 270
434 310
863 813
797 258
77 273
296 1248
315 372
510 496
1421 1860
2009 88
367 2851
323 1364
2518 814
1938 303
1557 261
703 1167
118 284
3021 98
2216 105
323 424
540 267
421 489
1226 281
641 326
554 301
281 437
529 745
98 1652
1108 257
335 354
326 347
360 287
270 278
1887 118
954 261
65 100
97 1609
1743 378
490 1769
102 2679
498 2553
277 457
577 684
1460 261
281 310
1018 289
413 316
258 352
73 110
110 443
348 1587
766 257
262 957
302 334
632 114
446 451
517 3042
636 466
2955 317
1094 305
2601 378
3037 515
71 117
1313 885
837 286
557 267
576 268
348 1844
97 1495
265 342
1863 508
547 398
299 1937
412 563
2785 103
611 310
870 1192
3339 308
284 309
116 1153
293 384
393 285
767 411
268 72
293 463
621 624
262 530
109 336
542 1327
1012 767
755 106
266 329
310 985
1112 103
3253 292
358 115
318 492
436 105
279 596
326 330
792 351
407 286
302 1576
463 540
356 273
297 1952
434 309
343 923
1277 267
1309 108
279 272
285 32
1412 291
1672 109
804 313
106 625
546 347
538 3097
291 1487
2473 2531
1392 109
102 266
1053 103
2659 3183
2556 365
2335 116
100 362
2383 32
80 284
760 377
265 274
1852 1283
343 306
776 398
402 736
115 97
670 314
434 316
2146 100
983 267
651 294
802 267
1079 532
981 395
302 1592
277 101
1060 532
2130 616
306 2109
411 459
271 256
262 396
319 652
346 529
110 573
352 317
348 441
274 313
109 392
522 1444
692 1286
660 257
335 333
511 2985
285 3426
302 121
272 279
589 304
320 377
279 1960
2946 112
1515 325
318 437
327 272
310 840
554 372
3149 103
334 1223
84 3440
491 306
344 269
1200 112
552 1594
116 101
550 353
360 108
105 1003
420 880
692 2293
389 260
577 260
336 257
644 294
436 2338
103 306
393 1203
987 1837
467 109
418 575
102 349
262 335
468 757
550 509
410 595
402 528
1036 319
465 257
1373 1674
399 1325
387 660
659 315
630 576
270 700
1963 317
116 276
300 2529
1120 899
600 310
1682 294
297 803
101 302
796 260
661 257
1043 302
403 278
384 413
690 286
1380 266
2635 301
384 257
454 425
306 1516
782 1278
112 296
589 116
477 734
77 275
342 115
455 268
559 104
775 286
1074 2581
440 327
870 1724
1006 122
418 99
69 259
433 625
33 260
195 129
116 668
1368 325
499 118
356 1192
784 887
1723 114
268 633
104 369
84 315
263 265
267 414
2940 351
436 381
2835 650
914 467
114 312
3137 1117
108 403
89 286
1856 422
346 348
76 281
374 3093
607 568
2421 808
3038 336
302 2424
266 538
348 776
1831 1531
1736 553
1367 1176
994 258
444 278
2426 460
103 315
65 109
695 258
1657 340
3463 488
636 438
686 316
262 329
504 34
374 1302
268 675
2576 265
510 1611
639 3483
1005 442
105 535
644 106
98 280
371 488
356 289
499 261
277 525
612 267
346 1857
114 261
1412 1127
387 1134
272 267
1813 471
541 1094
348 97
284 613
306 109
1811 319
2974 32
388 334
304 351
114 315
98 356
294 316
1341 296
111 773
121 377
44 307
410 278
314 556
108 356
2157 3033
1943 526
428 603
68 361
103 2208
363 960
545 122
111 341
2991 868
292 1438
418 264
269 595
446 553
1423 424
779 257
280 455
307 1049
1919 1280
282 1792
2078 2645
72 264
674 362
751 887
611 261
67 357
1667 476
444 268
666 1606
1081 774
306 991
86 262
713 805
436 286
258 662
380 116
564 347
859 667
416 264
464 391
1043 2007
2573 351
2011 100
358 563
70 117
277 1804
1443 279
370 114
117 324
275 3353
817 441
263 297
705 257
1021 274
395 449
359 449
288 865
99 274
514 272
336 282
601 293
393 454
454 1981
115 676
2982 285
1485 354
322 449
388 369
847 274
388 265
538 599
417 442
3598 537
256 330
957 586
2508 331
326 430
2267 256
110 447
98 101
296 2121
2511 1150
330 404
2767 594
483 576
544 624
1356 258
2090 336
1248 303
818 598
2944 110
346 703
639 668
2159 420
637 398
1154 274
538 265
520 1489
1340 507
735 377
80 105
483 258
402 474
347 1654
434 278
2270 503
579 437
817 356
122 629
314 327
387 732
65 2101
1423 944
2992 292
284 3690
270 744
77 392
1223 115
330 1402
284 101
359 452
1102 1156
469 350
428 344
296 511
363 543
309 505
303 267
281 279
792 287
67 308
478 116
289 116
1246 398
602 425
389 349
816 257
280 613
288 317
285 609
294 622
319 620
1378 977
294 723
901 98
296 3588
662 294
354 481
277 293
114 271
1233 322
1382 257
300 98
277 111
104 828
469 443
86 264
413 278
354 506
976 285
905 952
384 387
981 595
1333 296
2571 266
1626 341
1579 535
2475 277
2297 635
669 909
581 498
2658 257
296 737
2202 115
1306 108
2048 494
584 258
3672 427
118 276
1546 257
724 549
1851 103
440 350
985 503
897 1266
483 101
311 2952
496 604
327 633
2164 406
557 648
426 413
1504 267
336 278
693 317
513 524
1412 265
316 634
114 523
268 257
632 2931
489 643
446 351
895 257
2725 422
315 319
100 312
98 448
45 353
279 426
1978 389
316 272
118 312
89 260
1407 257
355 32
110 960
340 739
470 853
421 315
266 323
1306 1461
3521 1065
446 264
114 276
1008 305
269 682
363 276
283 2650
451 480
548 313
448 274
650 1198
1142 265
320 323
343 272
280 286
411 117
777 604
300 3378
3095 1434
100 457
280 281
385 286
320 122
563 278
2949 1861
2852 271
101 312
1026 3842
104 1159
1002 264
2337 746
335 2759
344 116
277 531
1109 257
492 282
267 673
385 256
264 276
1298 352
541 2683
2744 345
2375 256
652 313
2740 2435
584 377
1442 279
296 102
425 313
533 309
418 285
547 403
391 115
782 305
100 279
434 352
318 1457
940 717
304 355
564 313
288 516
1676 968
584 1601
980 913
935 257
489 294
451 754
809 261
72 276
3071 2395
947 281
2674 1255
323 1178
627 105
262 1568
394 350
875 268
1060 482
675 410
394 354
651 258
293 387
284 414
516 267
507 2495
398 278
292 395
279 287
335 371
358 325
281 337
448 359
260 268
3030 32
432 272
103 273
2482 99
3197 2396
516 309
479 546
777 400
350 272
98 979
1990 553
65 406
264 118
1285 287
3070 713
539 278
2562 1607
653 486
590 322
1357 273
258 258
302 1095
2159 291
1580 341
524 853
1213 286
940 1638
1148 257
2236 314
544 745
274 309
2893 897
1777 399
270 321
671 267
2905 695
846 850
495 377
389 121
278 769
1494 264
366 1237
71 114
785 667
112 640
832 395
432 353
713 1347
735 293
529 105
718 314
661 272
388 1208
262 2546
600 316
116 269
332 272
257 1089
302 1388
962 691
491 285
945 1335
100 275
279 1883
2563 485
115 461
103 1336
332 1659
531 643
342 116
330 528
1602 264
426 352
348 1370
326 445
301 105
365 115
602 631
2514 112
273 110
924 581
453 258
103 296
284 879
444 282
379 377
277 597
887 299
108 750
2160 788
666 1362
280 615
644 392
862 745
1288 451
438 309
1559 262
258 332
846 1960
97 1629
271 481
3386 370
292 262
1630 304
713 322
572 280
285 1570
501 287
670 326
344 329
101 484
1333 745
1071 282
479 362
116 292
552 701
1223 571
446 937
660 274
940 482
412 370
547 326
320 493
661 268
548 347
1353 264
294 570
1060 314
663 1795
1892 422
335 264
112 356
496 952
592 1339
806 267
273 836
797 564
904 2620
354 387
795 310
800 293
100 525
285 1521
3294 351
832 3905
289 279
2239 258
112 2716
101 340
108 283
274 310
287 1117
309 414
68 265
469 359
469 377
326 426
275 1369
309 274
287 288
270 1940
3303 512
281 449
265 615
116 271
724 257
1768 372
2757 4075
362 387
110 523
281 332
100 1258
736 516
285 370
306 452
293 421
100 696
529 624
1143 257
480 2481
264 322
371 117
397 514
330 481
1043 554
67 273
2846 786
267 753
349 121
105 1116
513 4098
632 1354
886 281
1540 411
335 3108
1139 622
115 488
574 121
370 308
1084 4107
103 271
4090 1652
334 4108
3458 507
257 664
293 438
1439 256
337 503
461 3170
1691 310
1269 1961
320 289
3245 106
1109 258
418 322
692 256
100 721
360 334
1133 667
3107 256
82 363
410 1419
689 310
306 454
383 889
1002 493
277 557
408 1991
99 654
291 289
585 310
469 807
97 3497
284 369
1240 279
66 117
3014 1177
403 374
268 77
122 473
277 859
511 287
112 625
1175 258
685 403
428 452
330 421
399 111
1689 285
980 4137
99 455
45 260
359 309
103 349
563 282
118 626
310 602
1025 286
511 108
112 490
284 1693
1032 293
333 460
3821 334
1078 1912
337 622
346 545
359 384
499 772
295 328
939 268
79 32
496 257
283 457
847 258
530 571
335 813
344 324
1842 604
3444 639
109 354
483 459
330 992
321 332
1474 76
1204 488
2330 356
544 118
735 279
679 416
1549 493
651 260
1310 944
3346 315
2787 4202
703 968
1821 695
268 757
2241 101
116 979
101 879
76 698
672 566
357 605
1672 512
2071 953
386 413
108 977
322 492
267 505
100 295
3702 441
277 264
1794 422
1172 493
389 1492
285 400
310 313
587 724
1870 325
279 1649
1074 637
832 1504
262 516
268 710
296 32
266 2020
417 268
103 312
544 996
98 275
267 347
526 350
1125 296
393 4242
1034 398
1791 294
2534 3171
281 438
2373 117
97 1150
666 268
529 475
1772 316
363 448
410 316
108 291
741 279
118 916
1588 273
319 671
1526 430
716 1850
689 442
398 268
276 115
399 1564
326 387
432 338
346 609
109 817
98 312
661 282
523 270
286 468
331 419
1109 256
102 256
387 1051
635 110
282 404
2096 115
1026 264
572 117
84 676
589 104
275 256
3539 2618
362 426
440 359
440 443
2558 904
863 1666
2231 403
596 268
2622 836
644 657
1341 750
958 282
1197 1511
1355 441
118 942
1069 835
292 257
945 3154
340 530
1909 32
432 408
402 1693
97 1962
293 1749
270 1159
1186 294
118 460
1669 305
1079 400
510 1016
762 260
279 812
632 292
281 309
782 285
618 411
368 552
431 272
1971 316
280 444
467 444
41 261
266 258
330 1067
882 281
334 1144
114 931
628 257
819 865
962 1624
685 326
2819 535
277 546
2121 284
283 444
287 111
1711 46
1082 327
2085 267
397 1377
1761 266
4253 361
285 564
428 2238
380 691
446 271
114 108
102 672
293 330
1217 702
409 554
531 353
2060 405
366 2240
3026 1341
392 384
720 268
84 447
806 452
846 3249
337 426
1759 271
317 404
1404 2154
679 105
267 274
2110 380
507 585
373 114
486 1534
343 2032
3126 646
284 399
816 258
2344 353
276 658
79 1601
321 313
365 122
293 437
346 331
362 506
3315 109
3267 262
744 112
430 1383
76 377
634 459
2538 258
3428 281
439 100
1727 256
409 372
265 327
104 3059
1582 341
760 257
592 959
331 575
2752 285
379 455
1238 260
541 260
526 525
903 853
277 968
116 265
2903 2301
611 260
1500 260
343 570
263 397
4129 269
118 295
266 516
266 1121
419 111
628 326
703 116
292 274
282 445
1190 1286
2328 500
117 99
346 914
117 122
338 1014
392 332
277 527
670 403
552 106
787 643
116 1253
316 2053
645 336
337 506
1037 314
1614 1130
1607 717
292 264
545 624
97 746
505 1338
320 476
315 455
329 872
1313 550
71 296
83 275
642 272
1625 104
101 823
794 267
287 350
295 1467
83 321
105 431
2150 535
1780 268
1313 915
84 114
1811 616
114 447
618 274
116 283
413 802
855 1417
858 355
426 310
862 845
1945 1095
1726 1188
629 486
100 527
1755 422
346 755
737 289
285 264
276 942
270 473
2690 321
348 1176
2794 485
886 257
337 387
938 1969
277 443
342 114
618 261
3922 863
1392 1420
4495 275
77 4016
1579 1864
1666 288
866 941
758 578
2130 672
4503 679
2075 498
1173 1070
2242 278
1261 1129
393 350
1795 278
323 331
71 4111
321 279
417 4294
1494 336
1313 565
354 820
294 451
381 286
330 569
822 106
1729 4521
1736 1130
313 374
590 279
987 372
432 318
108 671
689 260
680 1724
257 430
545 103
772 527
394 564
3281 3969
310 608
404 257
78 848
424 374
310 332
561 314
2815 484
489 260
1001 262
265 879
314 374
417 260
2204 850
294 438
1737 257
1532 1273
274 330
751 872
466 293
2789 624
287 1884
864 114
2074 73
297 3129
314 332
453 457
116 281
455 278
421 1650
469 1834
258 313
286 723
122 257
257 384
116 455
316 1123
1277 268
680 2187
994 377
77 1921
291 354
329 667
389 476
523 101
582 2888
108 313
287 942
2183 533
418 1671
482 278
98 351
417 839
787 260
266 764
451 1590
1278 386
316 285
297 306
277 721
268 596
102 322
320 265
1476 1127
73 4598
466 352
2228 2228
118 573
1506 268
681 108
282 923
391 276
330 426
362 481
756 514
425 347
115 265
275 101
1729 537
545 264
556 310
435 610
380 122
277 352
384 474
114 310
2480 1447
1365 1523
344 276
561 326
750 355
3535 937
310 348
3537 3044
421 1654
2718 1292
326 659
2548 274
3849 268
466 725
108 1667
2872 325
272 348
1456 278
711 387
4468 834
103 2277
2136 1072
864 500
536 576
930 867
284 1419
3214 773
1112 2282
314 520
417 261
97 341
323 292
404 449
277 808
1131 644
397 4029
554 106
588 327
1218 1083
1004 309
666 1728
304 419
1075 1293
360 2809
108 308
266 257
1152 257
395 384
1404 458
309 268
2333 695
783 875
1533 115
1023 4345
948 1804
306 276
549 1144
258 510
1190 264
1690 970
712 807
625 322
411 696
756 467
265 1007
1574 493
267 741
2299 485
1209 303
3087 99
65 1644
1099 317
417 352
374 1363
1023 739
300 413
292 610
588 258
755 787
432 1539
1782 258
2211 467
660 564
311 516
112 344
467 110
332 436
574 114
4349 365
337 404
361 108
473 345
80 1446
284 615
576 278
540 310
412 101
310 346
397 589
618 260
269 652
332 268
2414 1117
393 102
393 100
330 1300
286 1256
382 709
349 353
84 349
115 273
1758 267
398 279
1278 442
286 352
1036 955
627 256
97 383
897 292
633 310
2761 460
106 264
267 829
329 1337
407 521
4481 352
1088 316
283 434
1701 403
356 306
66 2022
830 281
330 463
1933 2191
279 317
276 751
327 347
285 2505
2649 1086
306 4284
97 1116
1012 365
360 271
1299 512
1829 1110
268 768
524 264
111 307
280 350
397 409
1018 2067
293 309
114 270
98 349
340 112
517 2801
3471 2170
1657 273
337 420
1071 278
116 901
392 437
78 415
393 542
400 347
496 501
108 260
110 750
577 261
772 294
84 321
432 1685
621 355
257 2624
393 2986
293 310
470 568
1214 1721
359 258
286 648
663 1293
97 1836
1469 431
279 585
516 1011
1088 352
1998 460
399 277
257 708
317 1195
451 257
1848 316
576 332
1924 257
763 284
1039 867
685 459
2406 726
713 262
330 709
1589 257
257 449
785 578
274 438
398 272
1386 395
97 599
495 521
628 459
492 410
630 1275
372 276
267 387
330 1519
65 382
1660 1993
1025 525
4068 2549
392 268
432 98
4037 3064
860 1072
688 991
2378 32
357 1693
315 548
266 105
2020 258
1819 493
1088 310
82 361
4851 100
1907 424
78 105
1099 481
914 624
558 2025
1128 1551
277 658
295 1952
110 594
302 1349
304 101
861 352
407 659
306 417
3199 285
1134 268
63 788
1204 262
313 311
65 78
832 260
552 986
283 273
262 102
408 578
319 258
381 260
713 395
315 443
109 326
344 1778
323 1504
1132 322
277 598
1082 294
326 337
653 109
1224 257
282 1809
389 1903
371 288
504 267
380 836
419 294
116 326
2941 272
99 281
118 488
278 2038
411 257
833 996
306 773
338 846
377 268
1112 260
1309 1461
440 286
397 372
373 2141
104 620
83 566
817 296
1053 111
323 1476
352 856
486 531
538 1758
766 430
379 105
1660 553
2008 4922
100 473
1373 1284
106 1060
1162 1227
1658 294
1232 759
799 313
1224 362
3203 110
2525 99
2297 875
86 2056
428 313
574 265
3186 98
1691 316
1372 834
871 365
1010 581
321 337
310 1104
712 568
489 327
108 515
306 106
413 414
492 278
1453 768
545 325
108 1127
265 504
824 434
1549 264
1301 331
520 1697
525 352
1392 559
602 1606
292 369
4219 285
440 521
737 99
981 652
67 722
279 873
286 622
630 928
387 880
100 305
463 742
544 573
657 310
891 258
284 110
1526 327
1320 258
477 1664
670 386
562 403
342 671
1584 406
2419 551
2971 419
314 337
278 1016
399 283
2334 272
2574 109
386 268
465 282
112 896
384 293
480 1151
337 540
438 316
3056 442
689 261
886 274
715 1624
311 1425
400 267
804 332
630 398
496 294
612 1457
617 278
2408 1070
589 383
1945 536
292 269
3713 1593
383 1237
1525 1444
1588 356
337 585
102 805
642 267
455 257
82 308
526 286
538 587
662 258
320 1638
280 377
3182 285
321 257
270 262
842 268
297 1467
257 806
268 820
784 581
2232 535
824 294
293 279
399 970
446 289
372 1179
3985 112
302 287
361 772
287 839
1618 268
311 324
572 101
258 327
120 904
69 5050
264 274
293 425
112 3526
2582 467
2889 991
1466 380
278 1832
116 287
270 256
625 575
314 659
384 309
66 262
2506 2990
278 436
2694 359
2896 362
279 936
300 750
100 597
2288 3913
257 316
1018 867
102 276
838 1757
310 617
1482 403
101 613
1263 280
109 364
282 732
1936 759
4485 798
90 5084
1619 2432
377 278
98 295
687 2197
4144 262
730 2054
435 1539
84 273
1019 729
102 270
3708 512
639 819
1465 258
115 1381
1532 341
775 274
559 675
724 258
554 663
1148 281
1643 341
3763 990
2450 2689
82 594
1087 757
576 272
2370 291
1489 272
677 425
2241 663
1147 306
118 835
441 2208
507 1166
489 593
841 452
1834 735
1165 459
272 404
281 384
1053 273
3462 105
270 295
523 351
1310 826
1288 1321
1248 695
100 1501
4210 319
1160 571
552 103
1241 267
4412 273
409 2858
284 308
1160 257
408 1359
3055 317
1499 289
323 5144
100 935
827 1068
388 566
2096 114
664 267
309 1225
98 411
2883 566
953 260
1423 269
277 1081
326 420
257 2362
953 316
1690 418
323 2134
99 4272
1647 257
292 1045
627 336
3298 637
67 1512
353 492
4051 281
438 352
102 863
1660 306
2036 322
430 1415
332 2814
330 633
4374 1333
663 4914
469 429
1172 400
291 350
2971 2099
1738 596
593 400
295 834
619 114
538 418
3027 286
740 347
346 2503
282 1175
282 1651
427 594
348 256
337 502
114 614
277 2182
302 105
340 382
635 293
111 1133
3512 108
882 392
3352 322
302 270
976 2977
383 1045
270 274
340 318
393 1651
383 845
257 820
356 442
383 1159
1408 259
441 2087
907 350
265 530
269 122
559 301
2682 354
309 602
662 327
2614 301
267 343
416 256
279 1611
999 2018
348 5047
2095 372
356 3589
268 791
989 4625
112 380
296 331
473 1874
333 430
1789 655
108 359
403 343
358 310
348 320
538 4762
100 546
2084 531
4100 282
939 374
296 99
392 330
97 431
347 837
65 302
331 118
1748 258
1263 274
3148 1413
4198 441
106 262
3272 88
99 359
1540 1388
77 848
1050 293
257 404
525 533
3302 406
2312 2358
565 615
1946 101
2009 76
4363 32
1830 277
410 310
567 270
5118 265
1909 609
619 99
2339 105
359 437
793 294
1199 503
410 293
1132 258
1465 286
669 268
599 559
584 289
2855 535
281 720
1180 2188
268 309
348 1507
3417 99
317 272
3211 256
383 807
1017 726
510 1382
1183 261
112 515
1229 309
570 556
5131 936
4208 103
2090 2104
333 1369
474 309
329 83
398 347
619 441
1017 293
2035 386
402 276
1212 293
643 293
270 3055
2765 476
98 316
1727 460
84 598
3884 5143
272 337
718 403
264 336
545 1664
334 324
101 1349
1291 2423
316 494
997 386
447 1367
303 279
2737 931
303 257
274 384
108 473
275 566
1532 1445
330 534
2105 268
2432 639
641 2934
557 492
384 533
257 1403
479 392
277 434
1333 105
337 1899
349 318
1224 434
398 332
86 1045
310 670
451 330
2200 3009
616 272
287 377
600 282
72 471
451 1256
607 889
448 277
1181 258
287 672
287 356
1706 403
1351 294
674 414
344 318
490 999
751 581
600 279
3885 3036
1181 274
714 309
863 1752
1380 661
3419 296
105 370
527 1337
672 103
84 262
495 350
2075 1575
1289 500
3718 575
330 518
104 345
471 326
4456 261
72 283
109 372
84 117
447 405
1553 258
3673 365
479 521
68 639
346 1215
932 267
100 593
5202 2113
76 855
86 275
547 256
521 272
824 281
116 5135
363 277
79 121
337 3251
322 452
348 260
121 434
311 399
118 356
363 639
620 359
340 353
1158 257
325 272
1691 352
660 281
109 294
577 2683
273 639
2094 354
552 443
1730 1174
556 5430
285 320
67 284
314 430
331 406
344 773
327 313
572 391
267 404
97 413
527 872
1507 1127
734 559
3441 285
362 812
350 445
1299 109
1001 276
432 456
4915 358
884 1970
1887 925
1207 532
556 257
334 739
660 350
1521 274
477 809
3838 5458
4322 566
4305 4498
3388 573
3203 339
681 4399
3200 103
542 3585
2649 3753
1971 310
574 109
1154 359
294 648
2476 314
1943 571
392 258
320 389
304 4910
882 322
842 386
101 615
541 454
1549 532
286 1245
1466 258
1094 273
672 355
2351 350
1958 467
520 310
68 598
560 313
499 108
3360 511
440 294
5112 102
1772 310
286 438
1017 911
323 610
337 518
278 272
1206 1800
1046 2023
550 408
257 352
536 1187
268 1080
532 267
940 493
2329 101
492 313
333 105
463 1272
4011 458
567 790
624 286
815 258
2095 274
68 101
109 485
1946 271
274 449
267 771
589 103
1460 516
3445 1070
2492 700
576 313
527 65
1385 1760
112 566
1783 585
369 268
311 1037
918 268
413 666
385 264
863 2509
302 528
463 257
278 936
97 1857
1082 926
587 599
950 409
270 643
939 445
279 791
631 377
1207 493
638 505
283 1467
294 733
311 991
474 278
552 2772
483 799
420 1063
279 453
316 282
776 459
279 500
268 2961
337 534
418 460
277 784
276 511
1166 404
490 99
268 873
2433 320
388 1623
895 294
313 1798
418 395
397 756
418 115
488 1804
358 108
4249 269
688 1420
1181 359
580 826
265 1136
268 664
444 257
711 347
4854 1053
296 100
707 274
1977 276
348 5590
568 268
428 1319
399 671
2880 319
103 284
105 490
530 431
428 103
342 678
579 301
326 374
265 477
871 514
296 663
2877 260
313 2463
1209 695
360 698
383 276
118 357
2492 266
284 823
306 333
348 105
329 1014
937 268
618 663
545 276
538 1360
824 362
316 385
719 286
257 662
404 310
627 1045
3524 5051
270 673
504 498
843 1996
331 4770
628 321
403 337
261 452
1226 350
457 278
592 1035
99 297
76 32
634 257
116 284
5059 977
280 560
344 264
4751 739
818 1787
265 1022
457 1011
495 597
999 801
5064 5650
874 797
281 343
122 270
3669 512
1018 1255
1872 257
256 343
486 269
63 318
407 327
884 1464
348 335
524 883
1927 297
302 1354
601 369
707 281
634 696
522 2123
393 108
304 536
311 333
452 279
993 350
3499 3269
77 801
609 112
530 678
2732 1463
66 264
2755 424
929 410
3275 424
4963 118
2352 460
2380 868
687 1629
1353 2645
2744 4044
2182 319
77 411
257 507
354 664
3091 122
2710 322
2204 2073
3407 354
1430 267
2299 1624
4500 650
606 294
1229 946
1963 313
391 2621
2224 1668
1715 293
2146 1488
374 923
1350 352
546 421
265 99
1665 256
321 268
860 326
115 729
794 500
103 973
106 105
105 106
273 258
115 262
510 436
3951 321
296 3416
956 553
2301 115
557 437
468 503
463 909
547 257
275 3502
4207 1150
948 264
331 292
109 868
618 281
2802 386
443 268
272 480
748 1290
881 991
425 332
2571 700
393 304
940 532
1215 279
78 1230
857 282
3750 535
409 265
4413 2277
525 316
525 278
479 327
286 733
1919 352
3500 564
352 1793
104 111
3578 755
100 434
500 1653
861 316
852 501
779 286
439 1068
967 286
430 1382
319 369
524 624
910 337
4321 2551
418 355
1107 2153
2879 467
800 369
382 528
661 278
854 451
102 356
562 799
111 1273
2155 309
1692 372
718 270
1062 916
5198 1121
121 3256
272 330
356 2207
3332 271
69 1364
262 118
1714 258
449 268
592 664
637 326
105 500
104 610
2595 106
420 1290
429 1011
288 278
2004 535
401 511
3132 99
608 508
1194 257
593 293
1005 336
2124 286
388 765
499 700
1075 303
265 509
278 404
106 273
411 114
1008 264
97 2568
3958 542
882 403
362 791
76 108
728 98
543 257
316 878
1582 1802
994 286
505 1490
1325 605
302 1541
383 1807
344 272
2078 264
84 105
284 292
743 679
104 1860
391 610
346 300
352 2250
373 110
103 5691
257 1027
347 816
100 658
118 594
116 639
287 315
689 414
597 268
285 797
275 1592
108 261
395 258
773 380
741 282
393 377
99 325
607 845
116 1110
395 437
2000 548
368 5403
547 386
306 1870
334 391
796 625
279 877
706 505
552 721
265 613
554 99
98 5727
438 278
540 272
275 1006
97 33
79 78
328 1467
564 421
583 872
2550 266
1103 1000
467 738
1039 571
291 286
974 1387
109 515
1090 310
852 1787
4759 4186
1384 545
277 269
3144 786
778 258
981 891
323 4719
330 892
102 291
337 421
2399 490
2482 1539
816 362
98 931
3612 1029
3235 4613
3208 305
5681 2238
1681 1434
4717 121
1755 114
431 257
1396 260
2933 386
358 334
1875 274
83 605
1896 1140
97 1643
1015 347
334 535
587 913
1016 294
2183 296
457 279
1604 99
754 309
1890 310
104 1763
1358 326
674 269
100 557
595 352
1034 403
83 4234
1969 286
1222 3457
68 297
432 4632
967 377
1111 317
5276 285
4203 2134
337 757
756 1198
884 257
1587 294
2964 467
2938 305
314 951
1742 1055
1750 267
2081 695
624 444
1480 268
296 496
779 740
265 554
299 878
348 1406
600 278
4014 382
491 838
275 5966
1618 272
358 3453
101 352
1950 1723
557 1457
256 468
111 378
408 498
1243 581
288 352
1732 320
524 293
392 282
2012 286
686 352
545 4462
2213 329
270 99
98 257
1070 282
97 1273
279 764
288 638
320 2977
5316 5042
1074 304
3857 259
397 1210
1783 317
277 521
333 326
2131 257
785 1359
417 1583
330 1400
634 270
658 267
264 828
5153 3106
474 272
532 313
969 280
316 465
3560 374
626 325
544 256
275 353
718 398
637 646
1497 267
421 816
359 492
2096 422
329 72
530 105
2488 293
278 909
100 585
784 872
1176 258
426 470
1855 258
560 268
313 1317
1856 114
1228 392
1794 114
2394 291
489 281
287 1327
275 477
3822 1117
943 739
459 279
787 316
404 278
316 257
2299 691
3232 467
546 506
284 1007
1126 540
719 350
3066 316
410 400
976 679
642 492
491 414
418 911
313 404
649 1832
393 642
297 419
354 267
269 4057
83 6062
434 282
277 4957
407 721
306 343
503 268
498 65
3349 594
359 704
582 114
330 585
1428 4878
395 309
410 313
377 313
293 669
330 500
86 611
628 1330
3316 676
268 2516
360 264
2930 321
76 258
825 380
1021 350
1690 112
1135 970
1395 2211
455 463
287 1308
522 769
1628 516
847 359
881 1188
270 839
294 1070
285 323
104 434
432 767
349 338
346 894
2578 1003
2392 3134
1135 295
989 263
78 286
302 4269
281 330
100 430
286 1429
274 317
5645 76
316 1047
546 332
904 269
3263 6118
2609 258
401 116
2327 362
392 492
294 1201
1603 374
783 403
1872 258
597 332
410 352
4621 346
1603 445
2993 2621
992 1182
3269 296
257 1057
270 110
418 652
438 282
1542 98
313 1009
854 267
3595 919
5220 868
3826 468
3342 482
1356 286
1149 274
2563 372
2501 272
675 267
2579 303
1725 258
4648 695
291 294
943 382
284 3254
804 764
3395 4257
68 538
1384 904
2953 307
389 694
2142 392
1879 326
578 1604
4783 678
637 459
2173 477
562 370
309 503
1453 795
468 699
956 381
2271 1048
5945 4506
4508 326
1361 99
257 702
1660 957
1323 413
1561 944
561 403
906 309
302 722
362 420
1672 738
1498 1452
570 651
346 815
320 834
372 676
3549 6191
98 1660
510 2925
714 452
274 258
277 4449
358 510
2175 695
293 449
1006 542
275 620
359 466
410 771
430 436
3765 3615
1954 759
102 726
330 880
451 1881
762 311
778 280
559 542
572 443
284 758
1053 305
1582 1445
275 395
660 354
637 256
549 99
271 264
2300 258
1023 1997
97 1445
265 2058
366 745
920 593
3278 116
1791 1908
5869 883
635 261
297 380
3317 294
84 611
393 1511
2719 99
601 322
257 812
5321 693
270 285
267 961
1002 1000
359 310
2716 412
1682 457
1759 282
690 377
990 362
593 413
556 267
526 327
1331 548
3160 515
597 992
294 347
1061 332
337 1264
454 311
800 395
264 1003
1168 276
784 1014
391 264
1334 276
384 332
408 1229
3063 99
1910 416
392 466
450 429
266 338
670 576
474 316
279 1911
2598 729
1938 789
1164 370
314 445
277 924
1415 257
258 347
268 272
529 611
737 1327
268 622
346 1524
2056 381
482 257
778 377
1261 6184
748 1080
267 569
630 459
115 626
527 1014
498 3509
116 501
1031 258
418 726
114 1667
106 283
352 268
350 278
934 343
337 764
295 694
6063 307
70 273
279 820
696 268
279 664
2184 32
641 2497
272 463
2111 258
283 317
543 279
2150 1687
261 384
607 334
403 425
77 269
1900 293
595 310
383 1511
5416 839
493 282
2202 323
320 1293
572 548
696 313
282 440
311 491
402 6060
432 613
354 420
1395 513
