101 32
97 32
111 32
115 32
13 10
44 32
101 110
113 117
101 114
101 115
97 110
263 256
100 256
111 110
97 114
101 108
121 32
111 114
111 259
97 108
195 173
97 100
108 257
262 32
111 115
97 259
271 32
97 98
97 115
100 105
111 261
265 116
195 179
99 105
269 32
117 110
262 116
101 259
97 261
195 161
105 110
195 169
128 148
226 298
115 117
99 104
99 117
100 258
109 105
273 32
114 101
260 260
111 109
110 258
115 256
100 101
111 116
108 274
288 32
97 109
108 256
108 258
59 32
266 116
118 105
266 32
101 261
115 105
195 177
264 32
270 32
97 260
115 101
46 32
99 290
116 105
108 281
112 270
114 105
99 308
276 257
112 305
46 307
110 32
116 111
299 32
112 117
275 32
108 101
117 105
99 269
300 32
100 265
114 97
111 260
114 257
109 256
44 260
258 268
101 100
97 99
275 108
263 105
280 261
109 117
111 108
257 268
265 112
266 301
98 105
104 283
81 345
100 290
101 260
115 116
112 114
98 114
109 295
100 282
367 106
375 312
258 267
276 32
83 364
108 105
100 277
99 283
116 262
335 258
285 106
297 32
291 32
102 117
116 117
368 376
103 117
284 261
112 264
115 296
265 261
328 324
101 109
266 303
116 114
264 257
112 273
97 263
277 258
373 259
110 105
108 32
340 100
338 341
112 111
323 32
98 117
266 100
121 258
116 256
117 287
101 99
118 264
112 105
108 108
291 257
304 32
114 32
103 114
288 339
311 260
317 267
109 264
115 111
286 272
257 278
103 258
100 111
114 363
257 267
104 105
109 266
121 260
263 369
433 269
312 114
97 116
295 32
280 260
257 272
268 278
100 117
195 186
97 324
405 32
382 357
263 322
121 261
99 284
100 269
258 272
318 272
294 272
285 314
283 257
101 122
275 103
307 341
116 321
108 344
385 258
267 309
262 289
333 257
450 264
104 356
101 301
118 415
97 103
297 406
99 355
264 116
99 97
99 280
109 101
394 32
108 327
262 303
112 284
299 261
372 256
97 289
291 116
262 100
396 273
108 117
99 273
265 256
401 267
439 458
360 301
118 292
427 475
194 191
115 264
100 274
97 106
271 260
115 325
58 32
366 336
300 259
340 303
266 122
58 462
279 278
102 105
109 258
112 262
292 256
97 122
261 272
299 465
271 278
97 304
379 258
284 260
279 282
111 98
115 283
286 267
116 319
97 329
118 262
271 108
99 270
288 110
264 290
121 257
287 257
381 32
292 114
273 105
105 109
299 494
295 110
365 279
100 264
115 275
277 257
116 349
281 268
311 106
274 268
289 110
390 101
118 361
68 105
100 257
99 111
311 289
390 256
97 318
472 351
109 111
274 272
346 116
99 334
262 260
258 257
379 111
101 103
99 315
276 321
287 256
396 305
116 257
109 262
270 105
104 117
264 110
270 290
297 110
104 97
194 161
349 122
89 32
265 302
99 306
111 329
287 258
109 280
371 111
411 262
112 306
333 416
101 289
294 267
407 274
497 32
293 267
263 386
281 272
112 334
117 114
302 398
104 257
331 262
105 259
264 258
276 261
104 273
117 115
409 100
99 101
264 114
105 114
111 318
46 260
111 99
63 32
319 256
388 256
98 270
109 275
111 106
104 264
454 268
105 100
447 339
101 116
97 121
112 269
263 355
97 112
464 103
285 301
282 302
358 279
464 118
277 273
97 291
304 114
108 293
101 106
101 324
513 115
111 353
261 267
100 276
277 32
311 98
99 319
393 258
285 115
380 99
109 276
293 268
112 275
265 257
115 258
297 339
281 267
97 353
257 347
409 99
284 256
285 289
461 291
108 443
296 103
104 256
78 258
397 112
360 272
104 357
114 117
265 260
110 274
388 264
118 325
280 105
342 101
114 258
109 292
479 106
110 415
118 117
293 272
100 280
267 310
419 315
109 265
385 111
98 306
100 270
567 296
118 275
115 260
284 378
304 292
283 321
328 260
101 118
470 325
274 267
295 339
555 422
105 422
115 361
344 260
394 258
100 326
275 116
271 313
285 99
311 99
402 282
428 485
277 286
104 308
312 351
314 257
116 308
104 471
115 290
359 272
108 270
636 267
118 101
578 272
102 296
256 268
110 117
322 272
109 291
112 277
411 279
688 509
304 115
358 264
116 264
297 108
99 257
109 257
258 279
287 442
109 343
116 273
105 303
114 111
117 108
268 347
116 343
268 313
97 118
97 338
104 284
558 594
102 273
109 378
342 293
371 265
33 32
280 258
285 103
423 266
490 103
283 114
101 431
115 378
302 292
98 108
402 378
110 350
302 343
479 285
100 286
103 105
284 605
331 668
363 264
417 381
320 370
348 101
106 117
302 114
112 101
262 647
111 338
80 508
97 408
116 275
39 39
320 100
112 448
300 260
97 606
104 269
257 313
115 269
357 378
118 296
111 122
277 274
271 105
333 116
115 261
115 386
536 256
256 267
276 110
276 294
354 278
390 322
103 487
328 103
108 521
342 287
349 289
300 271
112 108
435 106
621 586
297 114
111 289
304 259
370 537
59 260
306 112
435 822
531 261
266 260
440 258
287 459
302 319
257 374
65 110
302 275
115 331
257 257
262 122
582 542
110 111
295 259
104 362
99 288
116 270
295 114
379 286
69 339
297 603
380 372
97 496
105 32
109 269
287 286
389 114
82 111
264 261
65 32
81 117
104 321
602 256
111 408
356 283
263 264
309 310
111 276
114 265
115 271
407 281
116 258
97 301
117 351
109 626
116 315
89 261
402 518
277 105
110 665
277 305
389 32
589 810
318 452
423 321
276 323
270 109
114 280
102 315
550 484
728 698
115 356
194 187
68 746
276 327
440 274
519 292
889 549
97 331
100 262
893 101
284 105
314 282
330 278
99 271
306 289
360 106
401 260
432 316
618 98
358 323
383 103
392 272
99 265
256 272
346 260
383 336
588 257
115 292
267 316
270 310
297 259
565 484
460 32
319 293
520 785
289 271
684 256
118 258
280 329
266 261
279 347
326 257
97 456
262 285
265 562
267 282
105 391
270 261
297 370
417 535
263 101
333 414
489 257
287 281
315 274
411 115
424 268
469 258
551 320
103 814
428 272
380 103
302 264
552 274
490 764
264 286
102 264
116 447
319 322
391 270
555 114
313 267
752 571
277 294
383 431
110 308
523 575
108 350
112 487
257 279
461 624
315 273
315 514
103 963
266 99
270 114
326 268
80 117
97 117
97 335
315 292
330 282
287 105
371 296
580 269
598 427
109 296
359 267
677 268
680 305
103 266
103 345
109 270
348 302
109 274
435 122
440 281
391 370
100 114
117 100
262 103
264 321
383 325
608 114
102 114
304 116
342 285
104 270
267 413
99 275
101 329
116 397
446 263
69 406
97 387
112 676
284 329
461 420
277 354
382 460
649 583
731 114
287 117
838 301
99 264
262 261
279 332
472 114
103 275
519 103
112 265
258 282
362 278
109 273
337 278
342 355
99 266
100 271
109 369
109 412
268 332
287 274
344 118
366 108
682 271
108 111
111 102
105 482
310 316
335 836
366 568
68 256
366 325
97 399
99 361
410 309
660 258
100 502
296 116
314 278
395 272
538 473
291 258
111 121
277 281
478 257
491 116
365 656
453 331
824 650
100 336
526 258
100 273
105 98
267 352
288 310
314 268
342 395
102 708
333 591
100 534
389 320
436 400
561 292
97 320
111 456
115 288
118 416
287 283
337 282
256 257
470 264
499 320
99 544
258 374
275 109
841 512
98 334
100 361
267 278
279 313
326 278
853 549
270 260
280 318
402 271
1058 296
574 365
69 370
103 111
111 272
276 389
284 353
393 795
1039 319
287 114
292 306
454 260
266 289
275 260
383 289
97 423
106 487
285 258
299 1066
358 656
381 258
101 423
265 105
331 264
358 116
499 442
302 108
100 294
360 476
593 313
63 462
715 485
101 318
275 99
277 271
99 258
264 414
283 501
288 260
371 308
388 400
446 640
762 326
834 266
109 277
511 289
562 1146
674 122
524 325
98 580
101 304
104 486
334 370
486 424
97 391
306 296
397 274
792 257
346 323
348 342
399 293
404 268
105 289
586 399
830 258
112 355
257 421
267 279
435 289
980 289
77 364
288 261
105 419
112 471
883 399
109 112
269 99
309 352
478 281
641 892
118 798
292 488
653 763
954 32
109 281
269 268
326 279
273 100
572 287
871 1064
682 654
300 609
354 313
528 103
687 512
467 257
69 115
257 633
286 330
291 260
505 268
268 421
292 105
454 99
543 105
98 501
265 279
280 353
346 820
289 476
757 292
320 262
328 257
358 604
495 281
551 487
681 678
102 275
115 266
257 332
469 274
477 607
304 406
681 114
848 599
1083 317
89 258
83 849
84 523
1114 376
97 504
264 260
286 337
302 1050
495 257
342 585
558 497
608 336
104 32
265 329
309 316
1162 917
118 467
285 110
401 466
942 99
65 108
264 294
282 267
300 121
103 334
116 286
1108 317
101 353
265 258
300 909
304 260
333 331
335 350
737 261
811 624
902 325
80 305
326 282
333 434
336 268
373 693
423 412
734 512
761 268
264 269
285 114
299 329
388 492
403 272
540 923
545 116
559 303
109 397
273 312
418 262
106 315
109 97
264 280
572 274
65 765
84 111
110 416
116 305
118 919
112 473
257 387
257 755
287 306
397 371
436 258
495 258
577 904
97 613
99 610
320 114
730 432
67 519
105 103
295 603
320 258
491 515
498 856
806 300
118 257
267 410
284 318
293 278
428 372
491 114
539 918
559 122
715 372
1121 314
118 274
266 115
270 386
277 637
439 285
108 262
109 361
110 97
270 442
297 115
313 620
334 98
344 103
80 604
284 116
412 319
67 290
99 108
109 441
300 693
323 303
334 99
402 709
424 272
1106 365
76 312
100 529
105 116
108 763
279 267
306 99
351 272
380 98
511 114
83 640
108 278
110 291
778 258
974 293
1012 98
1118 277
1136 508
1231 280
1347 573
105 292
108 295
115 280
257 317
269 105
346 614
362 347
399 1140
473 273
679 322
992 258
997 448
101 120
106 599
260 67
280 338
295 98
1009 265
1281 537
101 331
101 338
118 614
297 260
394 377
412 286
517 282
70 575
112 271
265 353
292 930
300 115
304 108
328 106
373 115
407 257
832 865
97 302
110 874
1183 32
67 270
256 278
277 350
404 267
587 102
711 276
793 114
866 332
1327 391
1329 852
317 770
342 476
539 282
98 441
109 286
110 286
258 310
67 117
110 312
122 32
296 1117
392 267
495 274
632 343
258 330
270 352
316 733
469 276
472 678
1184 325
100 569
275 261
322 267
349 324
906 264
270 257
288 316
299 318
342 655
395 267
554 304
627 325
726 32
730 303
262 432
273 261
287 326
348 268
388 532
453 105
1310 386
108 294
261 570
272 268
275 1375
280 257
314 279
393 286
411 114
731 306
105 115
262 1153
300 112
323 1297
330 347
671 289
103 108
108 317
110 280
112 800
256 282
262 968
293 282
306 771
307 1380
311 736
629 1255
1479 1481
1480 983
100 281
291 327
362 332
401 451
419 262
517 885
100 32
326 272
335 790
346 1398
445 1173
719 258
857 268
111 484
112 280
121 353
270 269
283 294
333 327
358 400
519 431
540 904
646 727
962 485
1178 380
76 257
269 116
285 303
285 532
286 493
292 1179
331 114
598 109
97 484
283 316
320 553
417 115
526 257
1193 594
1474 423
267 268
275 431
354 347
389 924
507 282
528 336
752 116
1284 839
98 361
99 256
118 287
258 425
269 293
291 274
517 550
681 351
104 473
110 566
262 105
270 116
306 609
309 725
368 1392
371 676
1358 738
98 868
99 722
348 946
351 268
557 452
775 258
797 105
1236 258
99 277
111 112
111 615
111 1454
283 108
287 696
320 482
328 680
346 399
389 259
456 774
582 301
629 280
970 635
1084 293
111 504
284 408
289 117
329 581
342 323
412 350
498 596
787 293
101 285
195 137
311 261
539 550
539 565
98 614
101 408
102 108
103 286
103 514
105 381
121 482
264 327
281 257
313 500
329 68
391 114
496 599
543 703
561 351
587 118
813 377
848 869
1549 1175
86 105
97 615
300 365
631 286
743 110
1282 101
1600 471
68 1609
114 262
267 313
309 317
323 260
330 332
355 645
366 114
382 275
480 446
1002 645
58 307
265 322
270 316
276 266
294 493
358 655
373 802
446 114
489 261
517 565
579 79
602 279
689 261
116 827
118 256
345 289
523 948
577 923
58 260
257 282
257 310
272 257
441 306
513 281
745 103
101 98
106 1637
108 508
271 332
315 258
644 281
875 420
1018 256
77 611
80 355
97 105
99 441
101 102
102 750
108 296
275 1124
276 303
277 359
283 105
286 452
295 405
320 115
403 279
436 274
530 103
590 325
990 1094
258 384
382 114
407 430
572 359
777 264
99 262
331 610
340 260
412 616
470 256
535 268
662 482
735 256
870 305
1468 256
114 308
117 109
262 320
265 318
276 260
287 701
366 890
627 264
100 398
257 426
280 408
294 268
311 122
342 108
348 631
539 885
649 333
650 467
46 46
97 801
100 308
115 894
272 278
286 384
291 281
295 331
319 395
330 474
515 312
567 112
895 105
108 277
116 1155
268 481
273 293
277 261
294 330
306 103
323 114
453 849
477 117
631 258
711 336
1303 389
1367 1253
1405 1719
76 607
97 104
100 325
109 448
275 122
279 421
309 803
317 438
528 703
551 675
881 109
949 112
1710 115
1735 549
99 671
117 289
118 271
284 279
300 1139
530 116
580 424
931 365
1046 717
1191 325
1361 316
84 264
277 444
515 32
905 264
1063 265
258 337
276 527
285 431
366 264
385 377
389 109
566 286
574 98
590 256
1218 645
69 110
108 614
117 349
121 350
257 506
320 118
344 121
366 846
394 260
399 281
429 267
556 1494
649 781
863 303
896 831
1289 303
1569 292
110 486
264 460
286 310
299 504
302 1508
360 1112
446 267
483 743
499 336
529 294
577 432
694 384
833 293
976 790
111 613
258 309
276 457
283 357
287 538
350 267
587 781
653 283
773 103
1126 351
1747 102
76 101
99 357
100 531
257 330
283 334
286 309
405 260
435 100
477 112
832 116
922 258
1019 320
1043 901
1206 518
1354 476
33 307
67 1809
100 459
105 122
116 274
264 289
294 452
305 268
319 595
365 476
393 116
403 257
578 533
937 353
1129 112
80 952
100 287
110 277
257 337
275 98
275 278
279 387
310 352
323 108
346 304
363 486
478 434
811 345
843 269
1188 310
1355 109
76 1334
112 1055
195 188
275 283
287 1438
306 272
327 268
381 261
451 337
554 103
612 452
989 1081
115 515
257 309
257 425
281 374
295 260
303 272
419 273
517 918
526 377
639 1837
662 1449
816 1714
1350 635
1466 103
1729 331
66 105
97 307
103 292
275 293
294 309
294 337
294 449
346 662
363 280
380 109
384 410
418 116
469 286
496 869
551 417
902 264
1137 616
1544 365
83 117
100 315
256 279
258 316
271 317
344 122
354 332
399 117
436 264
619 257
780 370
856 256
1270 293
80 270
112 501
264 108
285 492
311 102
323 482
330 313
491 334
628 314
665 1542
1000 336
1070 257
1099 955
1395 695
1619 317
1738 266
68 290
98 284
105 802
109 319
109 573
111 372
115 322
262 302
267 293
286 466
399 284
515 448
878 314
1102 332
1346 575
1899 418
97 607
100 350
270 336
273 895
277 377
280 274
285 283
293 257
294 310
379 525
398 257
409 542
726 261
754 122
819 269
881 512
956 100
1514 293
1789 1364
97 102
97 611
100 474
110 273
112 291
112 416
267 474
314 272
316 505
324 257
526 281
530 110
589 289
608 325
811 291
850 116
970 876
1890 279
69 655
99 294
109 271
267 332
275 105
275 311
286 268
286 449
297 261
302 351
306 261
344 106
371 287
473 349
531 260
648 309
767 971
1632 1241
90 273
108 266
111 301
265 408
277 429
337 313
338 888
361 320
362 313
366 1044
488 114
530 114
538 401
576 257
621 436
663 274
761 1701
780 679
976 111
1092 514
1190 279
1482 88
106 270
110 544
117 271
264 309
270 108
296 105
326 332
363 319
383 995
419 266
470 336
579 65
590 854
632 349
710 256
833 261
1017 116
1199 790
70 296
97 1645
99 114
100 386
100 429
257 534
289 424
294 278
323 103
323 988
334 115
356 476
412 920
432 329
456 410
677 303
855 426
1076 314
1142 1385
1172 418
1305 278
73 73
80 273
83 1323
99 286
100 448
103 262
116 819
265 286
267 257
272 282
287 1107
288 405
315 98
330 387
335 1580
337 332
542 471
783 635
815 256
974 395
2075 983
108 332
109 537
115 308
263 610
264 759
277 1188
300 370
427 416
646 501
1161 542
102 319
103 361
104 281
104 1948
118 270
265 369
284 338
294 384
306 116
310 278
310 317
336 267
358 122
366 105
397 98
554 773
606 257
711 722
730 772
818 257
972 284
1034 616
1065 419
1246 264
1855 467
101 414
121 286
258 278
258 343
263 296
293 374
296 370
302 540
311 365
311 404
328 112
352 601
393 105
632 1436
818 869
1283 115
1541 820
97 624
97 758
285 422
303 268
305 272
341 267
363 275
432 1981
535 272
579 111
754 116
962 372
1020 256
1290 1125
1332 274
1705 441
1733 109
98 111
103 357
103 1205
277 584
279 569
314 343
342 303
403 282
429 309
457 309
559 320
663 281
687 739
702 267
754 109
776 508
788 329
1033 115
1194 458
2048 1459
97 823
97 949
118 97
262 115
264 256
270 103
273 260
350 268
499 260
552 359
830 274
843 1532
1772 258
1884 289
100 443
111 1148
112 488
279 502
283 580
295 261
330 507
346 388
349 118
417 331
504 788
562 277
921 257
1003 400
1024 281
1032 257
1065 1472
1516 400
1885 509
33 261
98 273
112 361
258 468
263 639
269 395
283 266
286 282
304 499
328 391
344 391
360 114
483 326
556 272
777 261
884 759
1041 118
1473 891
2003 320
97 509
98 262
98 264
98 269
112 629
276 827
302 533
337 347
524 105
540 432
545 336
574 1331
632 351
686 321
864 361
1032 279
1423 1165
1547 988
1612 566
109 322
257 348
258 437
265 338
274 374
340 99
353 272
365 262
409 485
418 114
590 805
780 122
840 503
1016 257
1362 591
1826 1370
1875 424
1937 376
105 514
257 481
263 640
265 281
275 739
279 534
286 480
287 327
315 256
315 305
318 267
326 313
383 105
428 317
524 336
527 581
587 418
646 1268
737 260
965 258
1104 400
1154 488
1244 268
1316 296
1530 434
1603 325
1644 320
100 359
102 101
104 315
111 758
116 369
257 418
262 1302
267 317
268 387
285 953
295 108
302 701
309 293
328 603
331 323
337 309
358 842
360 1139
390 729
397 393
407 350
441 292
453 116
453 257
507 426
526 274
620 274
760 110
782 2270
861 336
1000 442
1024 327
1249 2309
1326 288
2151 1241
98 529
106 97
118 979
278 267
279 420
284 276
287 398
295 115
296 726
328 583
400 282
401 438
478 657
543 116
609 98
972 620
1099 616
1356 305
2327 1069
104 327
104 1107
116 334
277 392
279 474
292 293
294 480
310 686
384 282
396 275
409 625
436 359
561 296
677 767
679 611
734 109
734 739
825 257
837 258
1004 386
1019 285
1248 326
1296 301
1546 398
67 2120
112 288
274 257
276 259
291 1195
306 100
319 933
328 321
335 325
346 99
348 112
377 309
413 352
447 110
477 276
496 264
500 268
543 996
551 118
852 98
1041 116
1172 653
1581 370
1660 273
2096 292
2112 442
2242 1168
100 321
102 486
277 334
292 322
294 437
300 640
318 648
329 76
332 267
343 268
348 262
355 277
379 429
384 317
488 286
540 684
634 326
775 377
981 293
1194 285
1206 529
1223 1337
1283 655
1620 553
1833 264
2020 116
2245 1750
83 101
111 118
284 322
320 639
329 1048
330 267
334 263
355 114
383 744
451 279
479 331
495 868
522 815
588 274
692 2094
710 279
906 400
933 275
975 1291
1214 256
1232 256
2261 103
77 105
82 105
97 623
100 392
102 800
108 284
112 326
257 1434
278 268
279 518
294 279
306 1213
314 347
331 289
354 421
365 1022
383 264
384 310
393 300
424 267
488 350
540 261
651 286
704 381
722 103
762 270
901 365
1137 319
1346 2033
1399 643
1403 256
1565 573
1874 419
1886 99
63 307
108 441
111 302
121 327
264 293
270 331
270 414
275 618
280 456
285 919
286 437
294 756
320 292
320 532
321 272
326 267
338 872
342 534
377 310
394 331
413 309
418 293
447 108
477 1901
524 256
588 281
713 282
760 286
801 322
1079 267
1102 426
1285 492
1306 1975
67 288
77 270
99 312
102 334
103 577
104 295
104 546
106 607
109 473
114 296
194 171
257 437
262 691
276 339
277 304
282 268
283 327
289 292
314 330
316 547
328 1702
340 329
349 329
356 264
356 284
377 316
421 570
425 278
477 106
478 116
483 314
490 1424
498 367
529 266
531 516
627 103
630 314
689 118
716 478
718 326
907 354
921 294
931 98
1142 625
77 573
108 276
110 1124
263 1388
270 334
273 1246
277 612
285 948
287 369
304 422
306 1001
346 102
347 315
348 728
377 282
478 1770
511 391
598 265
626 117
669 541
875 624
884 280
897 380
1047 268
1418 357
1463 108
2008 2451
65 263
68 276
77 117
77 1510
98 271
101 372
103 1865
111 316
264 351
268 426
270 328
274 445
277 327
279 506
300 475
306 1025
343 272
344 399
348 870
368 2265
371 523
408 667
418 256
419 264
501 262
622 310
687 109
689 260
691 258
815 279
861 325
863 422
875 291
881 739
907 257
1099 319
2565 573
67 108
67 269
98 265
102 665
106 101
116 306
257 474
257 556
267 533
277 362
285 116
286 257
291 100
302 413
327 267
331 32
357 442
371 996
383 568
390 369
466 310
500 272
578 431
629 101
935 256
964 267
1009 654
1027 277
1040 326
1078 492
1171 532
1368 566
1661 501
33 462
63 260
65 114
66 2582
74 117
83 319
257 468
262 620
265 296
268 506
279 529
279 712
289 114
293 426
295 289
302 295
314 267
330 506
331 109
343 382
344 301
348 261
363 591
366 722
389 351
467 294
574 436
583 325
824 280
875 1059
886 258
945 314
982 258
1090 1059
1226 274
1401 512
1659 416
1709 256
1819 268
2074 264
2590 2665
97 1133
100 297
100 536
114 284
114 345
115 276
118 321
257 293
257 569
267 337
276 926
283 362
300 418
306 121
317 268
320 320
336 272
346 798
365 563
370 334
429 282
432 99
441 334
450 286
451 384
470 279
477 121
486 943
536 2081
1273 261
1316 265
1787 115
1813 351
1824 461
70 933
97 414
97 561
100 444
100 709
109 514
118 359
262 99
264 105
265 346
270 306
281 425
283 926
284 456
291 105
344 1663
348 418
356 280
362 421
368 76
402 605
451 723
460 257
490 566
498 667
630 717
690 352
704 32
726 1459
957 261
1154 482
1193 497
1414 275
1558 2035
1915 106
2101 112
2374 323
67 105
104 361
109 605
115 605
258 430
277 548
277 560
278 1383
280 758
286 279
294 410
294 706
304 693
306 953
315 359
327 278
386 257
405 324
448 874
459 282
474 310
524 114
545 106
547 973
601 1342
692 1366
783 977
1008 1286
1081 115
1239 261
1309 424
1387 293
1396 641
1534 623
1560 424
2523 2462
2651 1690
84 1155
89 257
100 261
108 322
111 509
111 823
115 319
121 271
258 438
264 340
268 503
276 391
300 476
306 411
313 268
323 419
330 420
334 488
342 324
380 535
413 947
428 278
447 98
453 294
454 900
457 282
468 282
468 596
489 293
517 2043
584 581
674 256
870 273
929 774
939 896
1020 322
1104 492
1290 265
1311 278
1374 257
1564 920
1618 442
1760 654
1831 645
2548 656
97 417
101 571
110 356
258 449
264 281
271 257
274 437
277 114
277 2202
286 258
293 445
296 414
297 328
302 698
306 275
311 109
315 266
326 343
332 882
346 289
371 280
398 282
457 267
460 261
469 336
489 395
565 509
574 1397
577 1095
587 2768
626 996
716 1292
736 105
771 257
779 354
793 979
841 108
937 372
942 530
976 625
1089 289
1196 508
1218 277
1239 1457
1354 264
1471 537
1500 261
1817 269
2160 270
2843 573
80 264
82 101
84 308
86 415
99 448
101 456
118 266
257 420
257 503
264 112
264 362
265 456
279 481
280 504
283 430
286 278
296 446
299 456
307 68
314 387
334 103
348 783
371 806
383 285
400 278
451 410
466 316
522 1304
578 121
579 86
590 336
628 576
690 316
692 305
724 2862
766 362
843 865
894 118
914 105
1089 422
1393 101
1396 2259
1397 1118
1797 546
1856 431
2591 1913
2819 122
2923 289
46 888
67 315
83 105
83 378
97 1001
100 327
100 940
102 345
103 798
112 486
116 537
118 280
268 420
274 425
277 430
279 257
279 507
281 445
287 403
320 32
323 391
330 1237
335 111
349 116
384 278
402 502
528 568
546 313
646 256
677 98
745 285
762 934
796 257
850 105
1129 116
1185 281
1207 314
1467 650
1656 114
1656 678
1727 118
1732 1490
1860 310
1931 503
2328 509
2728 708
68 69
77 281
103 441
109 447
109 460
121 264
257 438
268 71
270 1333
275 571
282 570
286 316
286 756
294 257
294 258
294 466
302 301
315 262
320 501
360 437
380 116
380 485
407 443
407 750
412 326
488 264
491 269
497 293
498 1122
613 341
617 257
646 279
692 292
715 689
716 1062
762 973
853 995
905 604
1019 924
1089 114
1168 515
1288 293
1320 293
1534 744
1574 381
1659 625
1675 264
2679 2027
3031 2817
65 1147
66 280
76 274
100 1038
109 297
111 103
112 321
118 111
118 2018
122 111
256 2732
257 258
257 753
270 278
274 279
276 557
284 504
287 386
302 1841
320 2039
344 509
371 585
392 309
397 548
426 316
446 108
467 434
480 267
483 1291
507 317
532 257
590 264
615 498
617 282
619 1165
680 273
690 386
713 278
745 311
847 548
931 116
936 267
944 1682
1043 1352
1172 112
1273 260
1414 343
1422 398
1842 296
2053 2266
2317 2549
2382 476
2806 3054
2998 323
70 114
102 894
104 296
105 553
105 693
112 1762
118 1107
257 343
257 675
258 293
276 281
277 642
279 851
283 638
285 292
286 706
306 122
344 325
345 422
352 278
379 350
388 476
389 118
416 325
455 282
459 257
467 362
477 325
483 105
519 370
582 115
583 121
598 654
627 995
641 459
674 321
956 707
975 743
977 322
1070 321
1119 564
1126 349
1137 955
1217 1571
1221 423
1350 876
1547 391
1685 851
1760 265
2235 271
2338 1349
80 306
98 1336
99 291
101 504
102 471
264 354
267 400
268 507
270 516
272 309
287 273
294 282
295 802
296 320
310 505
315 333
338 581
385 492
392 449
393 1737
397 618
400 272
412 955
418 458
436 1250
439 1737
453 362
477 122
486 826
529 359
536 326
538 757
547 270
612 648
621 1298
658 272
666 631
771 258
782 2144
1021 99
1033 2080
1065 103
1223 2060
1356 1450
1473 440
1506 503
1606 422
2050 297
2071 424
2386 260
2830 332
2851 933
2917 2717
3149 810
66 270
76 117
77 273
97 333
100 293
100 508
100 518
100 800
101 391
104 275
109 308
111 623
114 800
116 354
121 354
257 593
278 789
280 879
283 527
296 1245
309 278
315 372
317 1677
328 1596
346 511
348 409
353 267
368 71
377 352
393 460
407 359
417 310
434 310
439 542
451 600
483 403
488 325
496 266
496 1777
510 496
511 99
511 1596
536 314
545 256
547 314
552 560
666 1788
670 270
767 266
776 326
797 258
816 515
864 813
982 377
1042 781
1055 292
1088 260
1147 114
1161 431
1212 258
1317 325
1378 2137
1418 1852
1576 532
1595 1861
1987 448
2030 644
2326 594
2426 826
2672 406
65 100
73 110
97 1610
98 1647
102 2671
110 443
118 284
258 352
262 953
268 267
277 457
281 310
281 437
302 334
323 424
323 1357
326 347
335 354
348 1597
360 287
367 2883
413 316
421 489
446 451
463 541
490 1771
498 2516
528 744
554 301
577 684
632 114
641 326
704 1165
766 257
954 261
1017 289
1110 257
1226 281
1464 261
1570 261
1736 378
1889 118
1941 303
2029 88
2220 105
2530 814
3000 98
71 117
97 1493
106 625
109 336
116 1153
262 530
265 342
266 329
268 72
279 272
279 596
284 309
285 32
291 1486
293 384
293 463
297 1939
299 1949
302 1577
310 985
318 493
326 330
343 922
348 1842
356 273
358 115
393 285
398 278
407 286
409 689
411 563
434 309
436 105
517 3093
538 3092
541 267
542 1333
546 347
557 267
576 268
611 310
621 623
636 466
754 106
767 412
793 351
804 313
837 286
870 1190
1012 767
1095 305
1113 103
1280 267
1311 108
1321 885
1409 291
1667 109
1866 508
2587 378
2770 103
2978 317
3012 515
3213 292
3368 308
80 284
84 334
100 362
102 266
105 1002
109 392
110 573
115 97
116 101
262 396
265 274
269 595
271 256
272 279
274 313
277 101
279 1965
285 511
294 316
302 121
302 1590
306 2115
310 840
314 556
318 437
319 652
320 377
327 272
335 333
343 306
346 528
348 441
352 317
360 108
389 260
396 343
402 737
412 459
420 880
434 316
491 306
522 1448
550 353
552 1588
554 372
589 304
660 257
692 1286
692 2268
760 377
803 267
981 395
986 267
1051 103
1060 532
1078 532
1199 112
1401 109
1516 325
1851 1282
2131 616
2148 100
2339 116
2390 32
2450 2518
2521 365
2669 3151
2948 112
3099 103
3385 1220
3401 2983
33 260
69 259
76 281
77 275
84 315
89 286
101 302
102 349
103 306
104 369
108 403
112 296
114 312
116 276
116 668
195 129
262 335
263 265
263 297
266 538
267 414
268 633
270 701
280 455
300 2519
302 2402
306 1515
336 257
342 115
346 348
348 776
356 1190
374 3045
384 257
384 413
387 660
393 1201
399 1323
402 529
403 278
410 595
418 99
418 575
433 625
436 381
436 2344
440 327
454 425
465 257
467 109
468 755
477 734
499 118
547 398
550 509
559 104
577 260
589 116
600 310
608 568
630 576
644 294
659 315
661 257
691 286
775 286
782 1274
784 888
795 260
870 1723
914 467
990 1841
1006 122
1034 319
1042 302
1069 2569
1121 898
1369 1677
1371 325
1382 266
1680 294
1720 114
1824 1525
1859 422
1959 317
2424 808
2629 301
2828 650
2904 351
3018 336
3098 1115
44 307
65 109
68 361
98 280
98 356
103 315
103 2201
105 535
108 356
111 341
111 773
114 261
114 315
121 377
258 663
262 329
267 347
268 675
277 525
284 613
292 1438
304 351
306 109
307 1048
344 269
346 1862
348 97
356 289
363 960
371 488
374 1304
387 1134
388 334
410 278
418 264
428 603
444 278
446 553
455 268
499 261
504 34
510 1621
540 1095
545 122
636 438
639 3461
644 106
651 294
670 314
685 316
778 257
994 258
1004 442
1339 296
1368 1176
1409 1125
1425 424
1668 340
1748 553
1814 319
1816 471
1919 1279
1938 526
2149 3043
2433 460
2571 265
2939 695
2950 868
2956 32
3471 488
67 357
70 117
72 264
86 262
98 101
99 274
110 447
115 676
117 324
275 3363
277 1793
282 1798
288 865
296 2100
297 802
306 991
322 449
326 430
330 404
336 282
358 563
359 449
370 114
388 265
388 369
393 454
395 449
416 264
417 442
436 286
444 268
454 1973
464 391
483 576
514 272
538 598
543 623
564 347
602 293
611 261
612 267
666 1607
674 362
703 257
710 805
751 888
776 398
816 441
847 274
859 667
953 586
1024 274
1042 1999
1082 774
1446 279
1488 354
1665 476
2026 100
2267 256
2488 1148
2505 331
2576 351
2734 591
2971 285
3548 537
65 2116
67 308
77 392
80 105
86 264
104 827
114 271
122 629
256 330
270 745
272 267
277 111
277 293
280 613
281 279
284 101
284 538
285 609
288 317
289 116
294 622
294 723
296 511
296 3599
300 98
303 267
309 505
314 327
319 620
330 1404
346 704
354 387
354 481
354 506
359 452
363 544
384 387
389 349
402 474
413 278
428 344
434 278
469 350
469 443
479 116
483 258
520 1489
578 437
601 425
639 668
663 294
735 377
793 287
816 356
817 257
818 599
901 98
905 952
975 285
981 595
1103 1156
1152 274
1220 115
1232 322
1245 303
1328 296
1338 507
1365 258
1379 977
1384 257
1425 943
2093 336
2152 420
2285 503
2947 110
2953 292
3697 265
45 353
89 260
98 448
100 312
100 457
110 960
114 276
114 523
118 276
118 312
266 323
269 683
279 426
280 281
280 286
283 2636
293 421
296 736
300 3322
311 2982
315 319
316 272
316 634
320 122
320 323
327 633
336 278
340 738
355 32
363 276
385 286
412 117
426 413
440 350
446 264
446 351
448 274
451 480
470 854
483 101
489 643
496 604
513 524
548 313
557 648
563 278
581 498
583 258
632 2910
637 398
650 1198
669 913
694 317
724 549
777 604
896 257
897 1271
985 503
1008 305
1142 265
1248 398
1305 108
1305 1456
1409 265
1413 257
1503 267
1540 257
1574 535
1631 341
1856 103
1976 389
2064 494
2161 406
2200 115
2314 635
2467 277
2570 266
2662 257
2713 422
2919 1861
3083 1432
3088 343
3459 1064
3622 427
65 406
72 276
98 979
100 279
101 312
103 273
104 1159
262 1565
264 118
264 276
267 673
277 531
279 287
281 337
284 414
288 516
292 395
293 387
296 102
304 355
318 1462
322 493
323 1178
335 371
335 2746
344 116
350 272
358 325
385 256
391 115
394 350
418 285
425 313
432 272
434 352
448 359
451 756
478 546
489 294
507 2513
516 267
516 309
533 309
540 2694
547 403
564 313
583 377
583 1591
627 105
651 258
652 313
675 410
777 400
782 305
806 261
876 268
935 257
945 717
946 281
980 909
1003 264
1025 3846
1060 482
1105 257
1295 352
1443 279
1678 969
1986 553
2331 746
2395 256
2453 99
2693 1254
2742 2437
2751 345
2898 271
2995 32
3044 2376
3197 2373
71 114
100 275
103 296
103 1336
112 640
115 461
116 269
257 1090
258 258
262 2544
264 274
268 257
270 321
273 110
274 309
277 597
278 770
279 1883
284 879
301 105
302 1094
302 1390
326 445
330 529
332 272
332 1670
342 116
348 1377
365 115
366 1234
379 377
387 732
388 1209
389 121
394 354
426 352
432 353
444 282
453 258
491 285
495 377
524 854
528 105
531 643
539 278
543 744
590 322
600 316
601 631
653 486
661 272
695 258
710 1351
718 314
735 293
786 667
833 395
845 851
925 581
944 1337
945 1639
1150 257
1212 286
1285 287
1356 273
1583 341
1603 264
1775 399
2152 291
2248 314
2485 112
2560 1608
2575 485
2696 343
2866 897
3048 710
67 273
68 265
97 1622
100 525
100 696
100 1262
101 340
101 484
105 1117
108 283
108 750
110 523
112 356
112 2720
116 271
116 292
258 332
262 458
264 322
265 615
267 753
270 1943
271 481
273 836
275 1366
280 615
281 332
281 449
285 370
285 1520
285 1561
287 288
287 1115
289 279
294 570
306 452
309 414
319 672
320 492
326 426
330 421
330 481
344 329
349 121
359 384
362 387
371 117
392 384
397 514
411 370
438 309
446 937
469 377
478 362
480 2455
496 952
501 287
513 4004
528 623
547 326
548 347
552 700
572 280
593 1344
632 1353
660 274
661 268
662 1802
666 1359
670 326
724 257
737 516
796 310
797 564
801 293
809 267
833 3869
845 1965
861 744
888 299
900 2592
945 482
1042 554
1060 314
1072 282
1144 257
1220 571
1288 451
1328 744
1557 262
1629 304
1770 372
1907 422
2175 788
2239 258
2749 4087
2848 785
3292 351
3299 512
3450 370
45 260
66 117
79 32
82 363
97 3512
99 455
99 654
100 721
103 271
103 349
109 354
112 490
112 625
115 488
118 626
122 473
257 664
268 712
274 310
277 557
277 859
283 457
284 369
284 1693
286 468
291 289
293 438
295 328
306 454
309 274
310 279
310 601
320 289
321 332
330 993
333 460
334 1083
335 813
335 3126
337 503
337 622
344 324
346 545
359 309
360 334
370 308
383 890
399 111
403 374
408 1990
410 1420
418 322
421 315
428 452
428 689
461 3198
469 359
469 807
483 459
493 282
496 257
507 585
511 108
511 287
530 571
563 282
574 121
686 403
692 256
710 322
847 258
886 281
938 268
980 4102
1003 492
1032 293
1077 1916
1105 258
1133 667
1145 622
1177 258
1238 279
1270 1968
1439 256
1546 412
1691 285
1833 604
3011 1175
3142 256
3228 106
3440 639
3491 507
3787 334
4042 1647
4132 4141
76 698
84 676
97 1148
98 275
98 312
100 295
101 879
102 256
103 312
108 291
108 977
109 816
116 979
118 917
262 516
266 2010
267 505
268 755
275 256
276 115
279 317
281 438
282 404
285 400
296 32
310 313
326 387
331 419
335 264
346 609
347 1651
357 605
362 426
363 448
386 413
387 1053
389 1490
393 1124
398 268
399 1558
410 316
417 268
432 338
440 359
440 443
523 270
526 350
528 475
540 260
543 118
543 995
572 117
587 724
589 104
635 110
651 260
661 282
666 268
671 566
672 267
679 416
690 310
690 442
704 969
716 1858
735 279
833 1503
1025 264
1026 286
1040 398
1069 637
1105 256
1171 492
1205 488
1309 943
1482 76
1530 430
1555 492
1587 273
1667 512
1768 316
1786 294
1796 422
1829 695
1872 325
2087 957
2091 115
2232 101
2330 356
2361 117
2517 900
2520 3154
2769 3328
3480 2610
3688 441
4228 296
4283 315
41 261
77 1923
79 1591
84 447
97 1969
102 671
105 431
114 108
114 930
118 460
118 941
258 510
266 258
267 274
270 1159
276 658
277 264
277 546
279 812
280 444
281 309
283 444
284 399
285 564
287 111
292 257
293 330
293 437
293 1758
321 313
330 1068
334 1138
337 426
340 530
343 2042
346 331
362 506
365 122
366 2236
368 552
373 114
397 1370
402 1693
409 554
428 2233
432 408
446 271
467 444
486 1536
531 353
585 310
596 268
611 260
619 412
628 257
632 292
644 392
644 657
679 105
686 326
720 268
741 279
761 260
782 285
809 452
817 258
819 865
845 3271
864 1658
882 281
944 3171
959 282
962 1634
1070 835
1078 400
1085 327
1185 294
1194 1511
1216 702
1339 750
1352 441
1402 2144
1492 264
1660 305
1707 46
1749 271
1764 266
1908 32
1967 316
2056 405
2070 267
2100 284
2249 403
2335 353
2401 2825
2593 836
2999 1339
3127 645
3205 262
3281 109
4224 361
71 296
76 377
83 275
83 321
84 114
97 746
100 527
101 823
104 3067
114 447
