101 32
97 32
111 32
115 32
44 32
101 110
113 117
101 114
101 115
97 110
262 256
100 256
111 110
97 114
101 108
121 32
111 114
111 259
97 108
195 173
97 100
108 257
261 32
111 115
97 259
270 32
97 98
97 115
100 105
111 260
264 116
195 179
99 105
268 32
117 110
261 116
101 259
97 260
195 161
105 110
195 169
226 128
297 148
115 117
99 104
99 117
100 258
109 105
272 32
114 101
10 10
111 109
110 258
115 256
100 101
111 116
108 273
287 32
97 109
108 256
108 258
59 32
265 116
118 105
265 32
101 260
115 105
195 177
263 32
269 32
97 10
115 101
46 32
99 289
116 105
108 280
112 269
114 105
99 307
275 257
112 304
46 306
110 32
116 111
298 32
112 117
274 32
108 101
117 105
99 268
299 32
100 264
114 97
111 10
114 257
109 256
44 10
258 267
101 100
97 99
274 108
262 105
279 260
109 117
111 108
257 267
264 112
265 300
98 105
104 282
81 344
100 289
101 10
115 116
112 114
98 114
109 294
100 281
366 106
374 311
258 266
275 32
83 363
108 105
100 276
99 282
116 261
334 258
284 106
296 32
290 32
102 117
116 117
367 375
103 117
283 260
112 263
115 295
264 260
327 323
101 109
265 302
116 114
263 257
112 272
97 262
276 258
372 259
110 105
108 32
339 100
337 340
112 111
322 32
98 117
265 100
121 258
116 256
117 286
101 99
118 263
112 105
108 108
290 257
303 32
114 32
103 114
287 338
310 10
316 266
109 263
115 111
285 271
257 277
103 258
100 111
114 362
257 266
104 105
109 265
121 10
262 368
432 268
311 114
97 116
294 32
279 10
257 271
267 277
100 117
195 186
97 323
404 32
381 356
262 321
121 260
99 283
100 268
258 271
317 271
293 271
284 313
282 257
101 122
274 103
306 340
116 320
108 343
384 258
266 308
261 288
332 257
449 263
104 355
101 300
118 414
97 103
296 405
99 354
263 116
99 97
99 279
109 101
393 32
108 326
261 302
112 283
298 260
371 256
97 288
290 116
261 100
395 272
108 117
99 272
264 256
400 266
438 457
359 300
118 291
426 474
194 191
115 263
100 273
97 106
270 10
115 324
58 32
365 335
299 259
339 302
265 122
58 461
278 277
109 258
102 105
112 261
291 256
97 122
260 271
298 464
270 277
97 303
378 258
283 10
278 281
115 282
111 98
285 266
116 318
97 328
118 261
270 108
287 110
99 269
263 289
121 257
286 257
380 32
291 114
272 105
105 109
298 493
294 110
364 278
100 263
115 274
276 257
116 348
280 267
310 106
273 267
288 110
389 101
118 360
68 105
100 257
99 111
310 288
389 256
97 317
471 350
109 111
345 116
273 271
99 333
261 10
258 257
378 111
101 103
99 314
275 320
395 304
286 256
116 257
109 261
269 105
263 110
104 117
269 289
296 110
104 97
194 161
348 122
89 32
264 301
99 305
111 328
286 258
109 279
370 111
410 261
112 305
332 415
101 288
293 266
406 273
496 32
292 266
262 385
280 271
112 333
117 114
301 397
330 261
104 257
263 258
105 259
275 260
104 272
408 100
117 115
99 101
263 114
105 114
111 317
111 99
46 10
63 32
318 256
387 256
98 269
109 274
111 106
453 267
104 263
105 100
446 338
101 116
112 268
97 121
262 354
97 112
463 103
284 300
281 301
357 278
463 118
276 272
97 290
303 114
108 292
101 106
101 323
512 115
111 352
260 266
100 275
276 32
310 98
99 318
392 258
284 115
379 99
109 275
292 267
112 274
264 257
296 338
115 258
280 266
97 352
257 346
408 99
284 288
460 290
283 256
108 442
295 103
104 256
396 112
78 258
359 271
104 356
114 117
264 10
110 273
387 263
118 324
279 105
341 101
114 258
109 291
478 106
110 414
292 271
118 117
100 279
266 309
418 314
109 264
384 111
98 305
566 295
100 269
118 274
115 10
283 377
303 291
282 320
327 10
101 118
469 324
273 266
294 338
554 421
343 10
105 421
393 258
115 360
274 116
100 325
270 312
284 99
310 99
427 484
401 281
276 285
104 307
313 257
311 350
116 307
104 470
358 271
115 289
108 269
635 266
577 271
118 101
102 295
256 267
110 117
321 271
109 290
112 276
410 278
687 508
303 115
357 263
116 263
296 108
258 278
99 257
109 257
286 441
109 342
116 272
267 346
117 108
105 302
114 111
267 312
116 342
97 118
104 283
97 337
557 593
370 264
102 272
109 377
341 292
279 258
33 32
284 103
422 265
489 103
282 114
301 291
101 430
115 377
98 108
401 377
110 349
478 284
301 342
100 285
103 105
362 263
330 666
283 604
416 380
319 369
347 101
301 114
106 117
112 101
261 646
111 337
80 507
97 407
116 274
319 100
39 39
299 10
112 447
104 268
97 605
257 312
115 268
356 377
118 295
276 273
111 122
270 105
332 116
535 256
115 260
115 385
275 110
353 277
389 321
256 266
275 293
103 486
327 103
348 288
341 286
108 520
299 270
621 585
112 108
434 106
296 114
369 536
111 288
303 259
59 10
434 819
305 112
529 260
265 10
439 258
301 318
286 458
257 373
65 110
301 274
257 257
115 330
581 541
261 122
294 259
110 111
104 361
99 287
294 114
116 269
378 285
379 371
69 338
296 603
97 495
388 114
109 268
105 32
286 285
82 111
263 260
81 117
600 256
104 320
65 32
355 282
111 407
308 309
262 263
111 275
114 264
115 270
406 280
116 258
117 350
97 300
109 626
116 314
89 260
401 517
276 105
110 664
276 304
588 809
388 32
422 320
317 451
275 322
269 109
114 279
102 314
727 697
549 483
115 355
194 187
439 273
518 291
68 744
275 326
890 548
97 330
892 101
100 261
313 281
329 277
283 105
617 98
99 270
359 106
400 10
305 288
431 315
357 322
382 103
391 271
99 264
345 10
256 271
382 335
587 257
115 291
269 309
266 315
296 259
564 483
459 32
318 292
519 784
683 256
288 270
118 258
279 328
265 260
325 257
278 346
261 284
264 561
97 455
266 281
105 390
269 260
416 534
296 369
332 413
488 257
262 101
468 258
423 267
314 273
410 115
286 280
550 319
103 811
427 271
379 103
301 263
551 273
489 764
263 285
102 263
390 269
318 321
116 446
554 114
312 266
750 570
276 293
382 430
110 307
523 573
112 486
108 349
257 278
460 623
314 272
314 513
269 114
103 962
325 267
265 99
97 117
80 117
97 334
329 281
314 291
286 105
579 268
370 295
597 426
358 266
676 267
109 295
679 304
103 265
109 269
103 344
347 301
434 122
439 280
109 273
390 369
100 114
117 100
263 320
261 103
382 324
606 114
303 116
341 284
102 114
104 269
266 412
445 262
116 396
101 328
99 274
69 405
112 675
283 328
97 386
460 419
381 459
276 353
648 582
730 114
286 117
838 300
278 331
99 263
261 260
471 114
103 274
518 103
361 277
258 281
112 264
341 354
109 272
336 277
99 265
682 270
267 331
109 411
100 270
286 273
109 368
365 108
343 118
108 111
111 102
334 836
105 481
309 315
365 567
68 256
365 324
99 360
97 398
659 258
409 308
537 472
100 501
295 116
313 277
394 271
290 258
276 280
111 121
477 257
490 116
452 330
364 654
824 649
100 335
525 258
100 272
266 351
313 267
341 394
105 98
287 309
102 706
332 590
435 399
388 319
100 533
559 291
97 319
336 281
118 415
115 287
286 282
111 455
469 263
498 319
256 257
258 373
274 109
840 510
99 543
98 333
100 360
266 277
278 312
325 277
852 548
1053 295
279 317
401 270
269 10
574 364
103 111
275 388
69 369
392 794
283 352
111 271
1040 318
453 10
291 305
286 114
265 288
382 288
274 10
97 422
106 486
284 258
357 654
380 258
298 1065
330 263
264 105
498 441
101 422
357 116
301 108
359 475
592 312
100 293
714 484
63 461
101 317
274 99
276 270
287 10
282 500
99 258
445 639
370 307
263 413
387 399
761 325
834 265
511 288
561 1145
673 122
109 276
522 324
485 423
333 369
101 303
98 579
104 485
305 295
97 390
792 257
396 273
345 322
403 267
398 292
347 341
105 288
828 258
585 398
434 288
980 288
266 278
112 354
257 420
77 363
287 260
105 418
882 398
112 470
268 99
109 112
477 280
640 889
308 351
487 324
652 762
955 32
118 798
268 267
109 280
325 278
272 100
870 1064
571 286
682 653
299 608
353 312
686 510
527 103
466 257
285 329
257 632
69 115
504 267
290 10
542 105
453 99
291 105
267 420
279 352
345 820
264 278
98 500
288 475
753 291
680 677
494 280
357 602
327 257
319 261
550 486
102 274
476 607
257 331
115 265
468 273
847 598
303 405
680 114
1083 316
258 308
1111 375
84 523
83 850
301 1050
285 336
263 10
97 503
494 257
341 584
606 335
557 496
264 328
104 32
1163 916
118 466
284 110
942 99
400 465
65 108
281 266
263 293
299 121
544 116
103 333
1105 316
299 908
901 324
334 349
101 352
736 260
303 10
810 623
332 330
760 267
335 267
325 281
422 411
332 433
80 304
733 510
372 692
263 268
558 302
116 285
387 491
284 114
539 921
402 271
298 328
272 311
109 396
417 261
106 314
263 279
109 97
571 273
116 304
110 415
118 918
84 111
65 765
494 258
286 305
257 386
396 370
257 755
576 904
112 472
99 609
435 258
97 613
729 431
319 114
490 514
804 299
294 603
105 103
497 854
264 258
308 315
67 518
319 258
558 122
427 371
490 114
714 371
118 257
266 409
283 317
1122 313
292 277
538 917
265 115
276 636
118 273
438 284
269 385
109 360
312 619
269 441
110 97
296 115
108 261
333 98
343 103
80 602
283 116
411 318
423 271
109 440
333 99
299 692
1104 364
99 108
67 289
401 708
322 302
268 105
350 271
379 98
305 99
100 528
511 114
278 266
108 762
76 311
1117 276
108 277
1230 279
777 258
110 290
974 292
1010 98
1135 507
83 639
1354 572
398 1138
990 258
361 346
279 337
105 116
108 294
257 316
472 272
997 447
105 291
345 612
678 321
10 67
101 120
1005 264
1279 536
106 598
294 98
115 279
411 285
101 337
393 376
101 330
118 612
516 281
296 10
406 257
291 928
327 106
112 270
264 352
303 108
299 115
372 115
70 573
831 864
97 301
1185 32
110 873
256 277
586 102
403 266
258 309
865 331
1329 848
276 349
710 275
1331 390
791 114
67 269
316 770
341 475
538 281
98 440
110 285
109 285
295 1115
67 117
110 311
631 342
122 32
494 273
391 266
89 258
468 275
471 677
291 1182
258 329
269 351
315 732
905 263
348 323
100 569
274 260
321 266
725 32
553 303
269 257
729 302
625 324
341 655
287 315
394 266
298 317
272 260
387 531
347 267
452 105
261 431
286 325
1306 385
279 257
271 267
108 293
730 305
260 568
313 278
274 1376
392 285
410 114
329 346
105 115
299 112
322 1293
261 1153
670 288
112 799
261 967
256 281
108 316
310 735
1475 984
103 108
305 769
306 1377
1479 628
1480 1253
292 281
110 279
100 280
361 331
290 326
418 261
400 450
516 885
444 1172
345 1393
325 271
100 32
856 267
718 258
334 790
332 326
112 279
961 484
518 430
285 492
357 399
121 352
539 904
282 293
1178 379
111 483
269 268
645 726
597 109
284 531
268 116
291 1177
76 257
284 302
330 114
282 315
1471 422
416 115
319 552
525 257
97 483
1192 593
274 430
266 267
388 923
1281 837
353 346
750 116
506 281
527 335
99 256
290 273
258 424
680 350
118 286
268 292
98 360
516 549
261 105
370 675
1359 738
269 116
305 608
110 565
104 472
367 1399
347 945
98 868
1232 258
99 721
556 451
350 267
796 105
286 695
581 300
345 398
327 679
455 775
1082 292
111 112
111 614
388 259
111 1452
319 481
99 276
282 108
628 279
970 634
786 292
328 580
411 349
497 595
341 322
111 503
288 117
283 407
308 723
195 137
101 284
310 260
538 549
538 564
847 867
1549 1174
121 481
280 257
586 118
103 285
390 114
101 407
812 376
105 380
102 108
495 598
559 350
98 612
263 326
328 68
542 703
103 513
312 499
1278 101
1588 470
742 110
299 364
630 285
97 614
86 105
68 1603
329 331
354 644
381 274
365 114
774 258
114 261
479 445
322 10
266 312
1000 644
600 278
488 260
372 802
445 114
58 306
275 265
293 492
578 79
688 260
357 655
264 321
269 315
516 564
344 288
576 921
523 947
118 256
116 826
257 309
271 257
512 280
58 10
746 103
257 281
440 305
643 280
101 98
106 1634
1017 256
874 419
270 331
108 507
294 404
80 354
258 383
101 102
102 749
108 295
282 105
99 440
275 302
402 278
530 103
435 273
274 1126
77 610
276 358
589 324
989 1093
319 115
97 105
285 451
381 114
406 429
776 263
571 358
339 10
534 267
469 256
99 261
869 304
1468 256
330 609
411 615
660 481
734 256
117 109
625 263
286 700
264 317
114 307
308 316
261 319
275 10
365 891
347 630
257 425
293 267
310 122
100 397
649 466
341 108
648 332
538 885
279 407
318 394
115 893
294 330
271 277
514 311
566 112
285 383
100 307
46 46
290 280
329 473
97 800
895 105
293 329
476 117
267 480
305 103
116 1152
1370 1252
108 276
322 114
272 292
452 850
710 335
276 260
1301 388
1414 1718
948 112
1707 115
630 258
527 703
97 104
274 122
278 420
100 324
316 437
880 109
109 447
550 674
76 607
1745 548
99 670
118 270
530 116
929 364
1043 715
117 288
285 308
299 1142
1361 315
314 258
579 423
1191 324
283 278
84 263
514 32
1062 264
276 443
899 263
365 263
388 109
258 336
574 98
284 430
384 376
589 256
1218 644
275 526
555 1490
648 779
894 830
343 121
117 348
257 505
1288 302
393 10
349 266
365 846
428 266
398 280
69 110
319 118
108 612
862 302
1568 291
482 742
285 309
565 285
359 1113
298 503
110 485
528 293
263 459
832 292
975 790
576 431
301 1506
498 335
693 383
445 266
286 537
1123 350
1734 102
282 356
121 349
772 103
586 779
111 613
275 456
652 282
434 100
1348 475
116 273
476 112
1204 517
282 333
76 101
1042 903
257 329
831 116
1018 319
404 10
100 529
99 356
263 288
392 116
67 1809
318 594
938 352
402 257
304 267
33 306
100 458
293 451
105 122
577 532
1128 112
364 475
1186 309
274 277
810 344
362 485
1351 109
258 315
257 336
274 98
322 108
278 386
100 286
477 433
110 276
345 303
80 951
841 268
309 351
195 188
450 336
286 1436
326 267
611 451
987 1080
112 1055
305 271
380 260
274 282
553 103
293 308
76 1333
257 308
638 1830
257 424
1720 330
816 1708
280 373
294 10
525 376
418 272
1353 634
660 1453
115 514
302 271
1469 103
516 917
97 306
345 660
293 336
274 292
901 263
417 116
495 867
468 285
379 109
383 409
66 105
1136 615
293 448
1544 364
103 291
362 279
550 416
353 331
854 256
256 278
1265 292
618 257
100 314
343 122
435 263
270 316
398 117
83 117
780 369
664 1540
1392 694
112 500
310 102
329 312
490 333
284 491
922 258
322 481
1098 954
80 269
1613 316
1743 265
1072 257
627 313
999 335
263 108
68 289
398 283
1341 573
111 371
109 318
261 301
514 447
105 802
98 283
1101 331
266 292
285 465
1897 417
109 572
647 308
876 313
115 321
279 273
1776 1357
292 257
1513 292
408 541
953 100
880 510
725 260
97 607
100 349
269 335
397 257
818 268
272 895
284 282
276 376
293 309
754 122
378 524
810 290
266 473
313 271
323 257
100 473
588 288
606 324
110 272
97 610
525 280
112 290
112 415
97 102
530 110
285 267
1899 278
849 116
315 504
970 875
266 331
274 105
274 310
529 10
428 308
285 448
296 260
621 435
343 106
370 286
99 293
109 270
472 348
766 972
301 350
1628 1241
305 260
69 655
1189 278
537 400
530 114
760 1699
575 257
108 265
365 1044
111 300
336 312
661 273
487 114
360 319
1090 513
337 887
361 312
780 678
975 111
264 407
1481 88
90 272
106 269
295 105
362 318
1016 116
709 256
263 308
832 260
1200 790
269 108
382 994
110 543
418 265
589 853
325 331
117 270
469 335
631 348
578 65
308 803
288 423
257 533
1168 417
431 328
333 115
100 385
99 114
355 475
322 103
676 302
1075 313
411 919
97 1641
293 277
1141 1387
455 409
322 988
70 295
857 425
1309 277
271 281
329 386
287 404
83 1321
782 634
99 285
80 272
103 261
336 331
266 257
974 394
334 1580
73 73
264 285
286 1109
100 447
541 470
814 256
116 818
2085 984
314 98
263 757
1160 541
109 536
108 331
115 307
645 500
426 415
276 1186
100 428
299 369
262 609
1063 418
729 771
815 257
102 318
969 283
305 116
710 721
293 383
104 1941
1852 466
365 105
553 772
357 122
283 337
118 269
104 280
103 360
264 368
1036 615
335 266
1244 263
309 277
605 257
396 98
258 277
121 285
276 428
101 413
631 1438
258 342
327 112
295 369
262 295
292 373
392 105
301 539
310 403
351 601
310 364
815 867
1545 820
1280 115
534 271
431 1974
961 371
302 267
304 271
1327 273
284 421
1286 1124
1703 440
578 111
309 316
97 758
362 274
1019 256
97 623
1724 109
340 266
754 116
1193 457
103 356
313 342
686 739
341 302
98 111
456 308
754 109
278 569
661 280
701 266
276 583
1032 115
103 1205
402 281
773 507
2064 1462
558 319
788 328
1875 288
498 10
261 115
263 256
551 358
349 267
841 1538
118 97
97 822
269 103
828 273
272 10
1768 258
97 948
1510 399
920 257
348 118
100 442
1063 1474
1029 257
294 260
1001 399
345 387
111 1146
1023 280
278 501
561 276
503 788
1884 508
416 330
282 579
329 506
555 271
883 757
285 281
359 114
112 360
776 260
268 394
262 638
2002 319
258 467
33 260
98 272
482 325
327 390
1033 118
303 498
1483 888
282 265
343 390
1423 1164
1029 278
863 360
112 628
301 532
336 346
685 320
539 431
98 261
522 105
98 263
631 350
275 826
1541 988
574 1330
544 335
97 508
1616 565
1935 375
339 99
1014 257
364 261
780 122
352 271
408 484
963 258
257 347
273 373
109 321
417 114
1355 590
264 337
98 268
1825 1346
589 807
839 502
1885 423
105 513
286 326
278 533
1312 295
1585 324
257 480
427 316
1529 433
382 105
314 304
274 739
317 266
586 417
264 280
1155 487
526 580
736 10
1242 267
258 436
645 1263
285 479
262 639
522 335
1645 319
1103 399
314 256
325 312
759 110
1247 330
2294 322
102 101
452 116
266 316
327 603
999 441
116 368
336 308
389 728
861 335
525 273
100 358
440 291
452 257
506 425
2150 1241
267 386
284 952
406 349
781 2287
104 314
619 273
1324 287
261 1297
294 108
357 842
111 758
257 417
396 392
1023 326
359 1142
301 700
112 487
277 266
477 656
399 281
2295 1068
283 275
286 397
400 437
608 98
1098 615
278 419
969 619
294 115
1363 304
98 528
327 582
542 116
118 978
308 292
295 725
106 97
835 258
278 473
823 257
276 391
104 326
408 624
1245 325
678 610
104 1109
395 274
559 295
676 766
309 685
293 479
1018 284
116 333
435 358
733 739
1003 385
291 292
1291 300
733 109
1547 397
345 99
476 275
848 98
67 2103
346 314
290 1194
275 259
305 100
1657 272
376 308
383 281
446 110
318 932
327 320
412 351
499 267
1033 116
542 995
112 287
550 118
347 112
495 263
2243 1170
1168 652
334 324
273 257
1579 369
2111 441
2097 291
1193 284
276 333
354 276
1832 263
383 316
347 261
2231 1752
342 267
320 271
774 376
331 266
339 328
2009 116
299 639
291 321
979 292
102 485
1617 552
539 683
633 325
487 285
1204 528
1223 1336
293 436
317 647
1280 655
378 428
1229 256
691 2088
329 266
905 399
354 114
290 100
2251 103
328 1047
932 274
382 745
450 278
973 1285
83 101
319 638
283 321
521 814
494 868
587 273
111 118
1217 256
478 330
709 278
333 262
102 799
112 325
77 105
1878 99
539 260
903 364
1341 2033
423 266
1557 572
330 288
278 517
650 285
348 328
353 420
97 622
277 267
257 1431
383 309
1403 256
761 269
305 1212
1398 642
82 105
392 299
1136 318
705 380
721 103
382 263
1866 418
293 278
364 1022
487 349
108 283
1076 266
319 291
285 436
269 330
274 617
100 391
446 108
121 326
1283 491
108 440
284 918
587 280
1305 1978
111 301
263 292
1101 425
63 306
476 1894
325 266
341 533
269 413
417 292
313 346
279 455
376 309
319 531
337 871
800 321
759 285
711 281
293 756
522 256
393 330
412 308
281 267
77 269
482 313
920 293
477 116
67 287
929 98
288 291
625 103
257 436
106 607
489 1425
528 265
327 1702
424 277
716 477
103 576
717 325
99 311
275 338
282 326
1141 624
109 472
114 295
476 106
261 689
355 263
529 515
497 366
194 171
355 283
629 313
906 353
276 303
376 315
76 273
315 546
688 118
102 333
420 568
104 545
104 294
313 329
883 279
376 281
898 379
272 1244
1028 276
487 263
284 947
303 421
347 727
108 275
286 368
345 102
874 623
269 333
511 390
110 1126
668 540
1418 356
597 264
1046 267
276 611
1464 108
477 1766
305 1002
77 572
626 117
262 1390
2027 2464
103 1861
263 350
101 371
880 739
418 263
370 523
269 327
77 117
620 309
77 1512
98 270
342 271
2563 572
273 444
688 10
814 278
500 261
906 257
305 1024
343 398
278 505
874 290
1098 318
686 109
417 256
68 275
861 324
862 421
111 315
299 474
407 667
689 258
65 262
267 425
347 869
367 2262
1167 531
257 555
276 361
389 368
276 326
67 108
465 309
67 268
370 995
284 116
98 264
577 430
1039 325
326 266
301 412
106 101
382 567
1658 500
257 473
116 305
285 257
628 101
1077 491
935 256
1383 565
499 271
266 532
356 441
964 266
330 32
102 664
1005 653
313 266
1775 115
66 2562
2597 264
2659 295
74 117
330 109
1226 273
466 293
582 324
292 425
874 1058
1713 256
342 381
347 260
294 288
63 10
100 320
388 350
574 435
278 528
1656 415
824 279
329 505
257 467
301 294
65 114
2074 263
261 619
365 721
343 300
267 505
981 258
278 712
362 590
1092 1058
33 461
944 313
288 114
1828 267
83 318
1400 510
1816 460
1270 260
369 333
364 562
275 390
884 258
476 121
316 267
257 569
114 344
431 99
469 278
345 798
428 281
440 333
459 257
319 319
450 383
100 535
449 285
485 940
266 336
114 283
299 417
335 271
275 925
100 296
282 361
118 320
97 1133
1312 264
535 2087
305 121
1815 350
97 559
263 105
347 417
118 358
109 513
1409 274
450 722
290 105
100 443
355 279
283 455
1561 2029
280 424
629 715
343 1661
282 925
1155 481
2115 112
725 1462
2389 322
705 32
489 565
269 305
1915 106
264 345
261 99
100 708
361 420
956 260
401 604
367 76
497 667
97 413
690 351
257 292
70 932
1192 496
1302 423
522 114
277 1379
404 323
546 971
2564 1687
285 278
458 281
2527 2459
1536 622
276 547
452 293
67 105
691 1374
544 106
104 360
385 257
447 873
473 309
782 977
115 604
1564 423
1239 260
258 429
109 604
305 952
326 277
1388 292
314 358
293 704
276 560
279 758
1080 115
1006 1282
1397 640
303 692
601 1345
329 419
121 270
1817 644
1760 653
312 267
937 894
285 258
1286 264
305 410
453 900
488 292
467 281
446 98
869 272
108 321
115 318
379 534
1614 441
583 580
673 256
467 595
111 822
322 418
930 775
115 275
299 475
1303 277
2545 654
111 508
333 487
456 281
1558 919
1103 491
1019 321
263 339
293 409
516 2044
89 257
267 502
412 946
100 260
427 277
341 323
84 1152
2160 269
331 881
97 416
292 444
301 697
2813 572
459 260
258 437
295 413
276 114
296 327
258 448
1087 288
574 1396
270 257
370 279
110 355
1372 257
468 335
76 117
325 342
263 280
1477 536
938 371
778 353
769 257
586 2751
1239 1460
345 288
397 281
1348 263
273 436
716 1287
310 109
975 624
456 266
626 995
305 274
942 530
840 108
576 1094
101 570
276 2207
314 265
1508 260
1218 276
1196 507
791 978
488 394
564 508
1822 268
735 105
82 101
306 68
313 386
295 445
2814 122
347 782
724 2858
86 414
370 804
2910 288
333 103
264 455
893 118
84 307
450 409
577 121
279 503
118 265
278 480
763 361
1396 1117
285 277
1857 430
1394 101
691 304
263 112
101 455
521 1300
841 864
465 315
690 315
399 277
589 335
1794 545
1087 421
99 447
80 263
382 284
282 429
298 455
913 105
1397 2258
578 86
263 361
257 502
627 575
257 419
2598 1912
348 116
83 105
67 314
1654 114
280 444
278 506
322 390
1128 116
1467 649
545 312
334 111
273 424
286 402
1726 118
116 536
1183 280
100 326
342 922
102 344
276 429
103 798
319 32
292 383
746 284
645 256
2317 508
1933 502
112 485
1731 1493
1859 309
100 943
97 1002
795 257
118 279
329 1236
1203 313
401 501
527 567
1654 677
267 419
278 257
676 98
761 933
46 887
849 105
2728 706
83 377
899 602
1673 263
274 570
406 749
267 71
103 440
852 994
3003 2702
68 69
1107 257
1656 624
109 459
411 325
379 484
1087 114
77 280
714 688
490 268
406 442
691 291
301 300
1170 514
109 446
359 436
616 257
293 465
383 277
285 756
379 116
269 1332
285 315
1018 923
314 261
716 1061
497 1120
281 568
645 278
319 500
293 258
121 263
1536 745
2690 2020
293 257
613 340
761 971
1576 380
425 315
1831 295
1877 118
844 547
466 433
66 279
482 1285
273 278
711 277
445 108
286 385
100 1037
1314 292
111 103
275 556
616 281
112 320
65 1149
109 296
458 257
934 266
589 263
269 277
1409 342
3019 322
679 272
479 266
929 116
1270 10
506 316
2297 2529
118 2018
391 308
343 508
122 111
370 584
319 2039
301 1843
939 1684
531 257
257 752
690 385
283 503
1422 397
1168 112
746 310
1042 1349
614 497
396 547
618 1164
2371 475
2849 256
3094 2767
2048 2265
1541 390
282 637
388 118
378 349
257 674
763 257
1760 264
102 893
275 280
581 115
2232 270
70 114
973 742
476 324
415 324
466 361
305 122
640 458
105 692
105 552
518 369
104 295
665 630
625 994
276 641
343 324
1214 1560
597 653
953 707
1072 320
496 292
1685 851
454 281
278 851
1118 563
582 121
284 291
1353 875
482 105
1222 422
1289 292
344 421
1123 348
258 292
1136 954
673 320
118 1109
351 277
285 704
977 321
112 1761
387 475
2346 1369
2852 932
1032 2069
1021 99
2070 423
2905 2700
476 122
2815 331
433 309
535 325
102 470
537 753
435 1249
485 825
267 506
293 281
337 580
2053 296
391 448
308 277
294 802
399 271
657 271
295 319
98 1335
286 272
392 1740
266 399
769 258
1223 2058
263 353
283 101
2382 10
384 491
269 515
99 290
528 358
80 305
3186 809
611 647
314 332
396 617
781 2147
1063 103
546 269
438 1740
452 361
417 457
411 954
1606 421
1509 502
1483 439
1363 1449
1418 1845
509 495
314 371
295 1243
77 272
796 258
76 280
863 812
66 269
511 99
97 332
327 1590
1086 10
406 358
104 274
392 459
109 307
316 1676
2406 825
352 266
376 351
450 599
292 462
495 1778
1055 291
669 269
100 517
816 514
116 353
2681 405
367 71
981 376
1378 2133
309 504
100 507
766 265
282 526
416 309
1599 1844
257 592
271 308
482 402
279 879
546 313
100 799
535 313
551 560
621 1298
345 511
511 1590
2324 593
544 256
495 265
665 1789
347 408
438 541
1313 324
121 353
114 799
773 325
277 787
1149 114
1987 447
1211 258
1574 531
1041 779
1160 430
2028 643
111 622
301 333
261 952
267 266
110 442
73 110
258 351
1016 288
1459 260
576 683
497 2522
102 2671
489 1793
118 111
1737 377
659 257
265 328
97 1604
65 100
955 260
359 286
462 540
325 346
334 353
101 503
98 1647
527 745
280 436
640 325
1226 280
347 1595
420 488
412 315
322 423
2225 105
257 437
631 114
276 456
705 1164
553 300
1569 260
280 309
3036 98
1948 302
2550 811
322 1356
2026 88
445 450
366 2901
290 1485
537 3044
545 346
106 624
801 312
1653 109
408 688
1405 290
284 32
278 271
1303 108
1271 266
433 308
355 272
791 350
325 329
317 492
3218 291
1112 103
1010 766
541 1332
109 335
261 530
766 411
754 106
392 284
116 1153
283 308
869 1189
3347 307
621 622
406 285
610 309
357 115
2784 103
410 562
546 397
309 983
1870 507
301 1572
97 1491
575 267
556 266
264 341
835 285
1318 885
71 117
3029 514
803 266
267 72
540 266
2620 377
1094 304
278 595
435 105
2991 316
635 465
296 1942
283 613
100 292
347 1831
298 1950
516 3096
691 2266
105 1000
359 108
268 594
549 352
1200 112
84 333
3388 1219
3104 103
313 555
257 342
490 305
1510 324
2911 112
588 303
271 278
301 121
101 390
326 271
284 511
3401 2957
419 878
691 1282
521 1443
553 371
109 391
273 312
347 440
334 332
345 527
319 376
318 651
111 340
261 395
395 342
411 458
305 2110
2130 615
1060 531
276 101
301 1593
317 436
979 394
1077 531
650 293
985 266
2153 100
433 315
351 316
115 97
401 736
773 397
270 256
1851 1278
264 273
658 314
116 101
551 1589
261 328
2388 32
100 361
2342 116
257 258
388 10
759 376
2558 364
2694 3184
1049 103
102 265
110 572
309 839
342 305
278 1959
1400 109
2472 2535
1816 1524
279 454
347 773
301 2401
3000 335
345 347
1846 421
89 285
108 402
3108 1114
913 466
2818 649
435 380
2909 350
266 413
84 314
262 264
104 368
267 632
1725 114
783 887
355 1189
498 118
1375 324
116 666
195 129
262 296
33 10
432 624
69 259
417 99
1008 122
1068 2567
558 104
439 326
77 274
588 116
341 115
112 295
781 1274
305 1516
453 424
383 257
2643 300
1382 265
383 412
402 277
606 567
476 733
1041 301
662 257
794 10
101 301
1683 293
599 309
689 285
1122 896
299 2555
116 275
1966 316
269 700
629 575
386 659
464 257
1036 318
401 528
774 285
409 594
114 311
549 508
467 755
261 334
869 1727
102 348
417 573
466 109
989 1843
392 1198
398 1321
435 2335
643 293
335 257
576 10
1371 1676
103 305
2403 805
373 3048
265 537
1907 1251
306 1047
777 257
1421 423
445 552
343 268
2952 868
103 2194
68 360
2142 3004
108 355
417 263
409 277
44 306
111 772
1342 295
1943 525
114 314
303 350
387 333
2968 32
1811 318
109 371
305 109
427 603
291 1436
539 1094
1808 470
454 267
386 1132
1405 1124
98 355
345 1848
611 266
276 524
498 260
362 959
258 661
98 279
669 313
643 106
105 534
1003 441
638 3509
509 1620
2571 264
2942 694
347 97
373 1300
293 315
503 34
80 283
370 487
684 315
635 437
3528 487
291 487
121 376
355 288
114 260
103 314
2449 459
443 277
993 258
118 283
1383 1176
544 122
267 674
1746 552
542 622
482 575
2732 590
329 403
2486 1146
295 2102
2247 256
325 429
2489 330
3553 536
416 441
537 597
387 264
844 273
321 448
1487 353
2960 284
115 675
453 1979
392 453
600 292
513 271
99 273
394 448
1023 273
703 257
98 101
816 440
274 3343
117 323
369 114
952 585
287 864
1444 278
276 1798
70 117
2024 100
387 368
1041 2004
463 390
415 263
271 266
2574 350
563 346
435 285
709 807
86 261
296 802
305 992
1085 775
358 448
665 1607
859 667
335 281
110 446
1659 475
610 260
67 356
1670 339
673 361
443 267
72 263
357 562
281 1805
751 887
1326 295
979 594
899 951
973 284
353 505
329 480
86 263
276 111
1380 257
1229 321
114 270
276 292
353 480
661 293
295 3560
903 98
293 722
1381 977
318 619
284 608
287 316
601 424
1245 397
288 116
67 307
791 286
279 613
478 116
280 278
362 543
295 511
468 349
1099 1151
358 451
468 442
353 386
329 1402
1219 115
77 391
2981 291
1421 940
65 2121
302 266
313 326
122 628
816 355
577 436
293 620
433 277
2285 502
269 746
401 473
343 328
104 826
80 105
1343 506
283 537
3735 264
1154 273
2158 419
636 397
638 666
345 705
734 376
427 343
815 598
412 277
1243 302
817 257
2098 335
519 1489
299 98
2906 110
2903 1844
562 277
319 122
279 280
100 456
3046 1429
299 3322
776 602
319 322
1141 264
649 1197
547 312
450 479
447 358
272 110
362 275
268 681
1006 304
114 275
447 273
445 263
383 386
388 348
3472 1064
469 853
339 738
354 32
1412 257
89 10
118 311
315 271
1981 388
278 425
45 352
282 2432
100 311
314 318
2714 421
894 257
445 350
488 642
631 2927
114 523
1405 264
411 117
512 522
693 316
335 277
1502 266
425 412
2172 405
495 602
265 322
308 504
898 1268
482 101
420 314
1857 103
439 349
724 548
1546 257
3668 426
326 632
384 285
3087 342
582 258
2200 115
295 735
258 331
482 258
2696 257
580 497
668 912
2323 634
118 275
983 502
2473 276
1576 534
1633 340
315 633
2583 265
2065 493
310 2994
1309 108
1309 1458
263 118
65 405
1971 552
776 399
477 545
3153 2374
2450 99
431 271
3005 32
280 336
357 324
291 394
506 2498
292 386
650 258
674 409
1060 481
875 267
393 349
625 105
322 1178
2677 1272
945 280
283 413
3060 2377
349 271
334 370
804 260
488 293
935 257
980 908
266 346
582 1586
1675 968
563 312
303 354
556 647
103 272
944 715
317 1463
433 351
100 278
781 304
546 402
532 308
424 312
397 277
295 102
515 266
287 515
582 376
2754 2447
651 312
72 275
2397 256
390 115
321 492
2762 344
539 2668
1294 351
417 284
384 256
278 286
263 275
266 672
450 756
1106 257
1445 278
261 1557
334 2739
1001 263
279 285
276 529
104 1159
98 447
98 978
343 116
515 308
1024 101
3915 311
2900 270
2347 744
443 281
103 295
452 258
924 580
2496 112
364 115
300 105
347 1373
393 353
425 351
1585 263
529 642
110 959
103 1335
115 460
341 116
100 274
939 1336
301 1384
331 271
329 528
599 315
328 76
261 2541
662 271
717 313
387 1209
527 105
559 325
709 1352
431 352
832 394
112 639
785 667
71 114
734 292
1496 263
283 879
386 731
277 770
365 1234
494 376
845 851
2582 484
269 320
1786 398
331 1664
276 596
116 268
2883 898
490 284
273 308
542 745
2242 313
1148 257
944 1635
1211 285
522 853
1582 340
2158 290
378 376
278 1881
89 1228
694 258
301 1093
388 121
1363 272
257 1092
267 257
589 321
2683 342
2584 1605
538 277
601 630
652 485
1283 286
3061 709
1364 258
631 1347
512 105
3998 1115
2809 784
67 272
396 513
263 321
256 329
479 2451
1140 257
527 622
100 695
284 369
736 515
100 1258
110 523
280 331
361 386
2741 1766
4015 371
724 257
116 270
264 614
3280 510
358 308
468 376
273 309
101 339
112 2712
2238 258
288 278
832 3847
3290 350
800 292
795 309
900 2590
282 456
796 563
272 836
391 383
592 1344
318 671
495 951
112 355
334 263
1902 421
660 1801
1060 313
293 568
547 346
284 1519
662 267
806 266
68 264
325 444
319 491
546 325
348 121
944 481
659 273
1219 570
551 699
116 291
477 361
1073 281
1326 745
269 1951
274 1374
101 483
261 457
669 325
410 369
284 1567
266 752
468 358
1624 303
286 287
100 524
3448 369
270 480
97 1625
845 1959
437 308
1289 450
370 117
861 745
571 279
1041 553
258 258
286 1114
279 614
292 420
1566 261
665 1358
305 451
500 286
280 448
445 938
2177 788
108 749
887 298
320 331
329 991
482 458
109 353
3387 638
1832 602
343 323
530 570
844 258
495 257
79 32
936 267
294 327
345 544
3767 333
332 459
1029 292
112 489
511 108
506 584
1025 285
281 922
1078 1913
562 281
103 348
45 10
99 454
1693 284
398 111
427 451
1175 258
511 286
427 688
122 472
402 373
3017 1174
66 117
1237 278
283 368
97 3493
468 808
309 278
980 99
4140 653
112 624
685 402
283 1694
1001 491
439 358
382 891
409 1419
82 362
3136 256
1133 667
290 288
334 812
118 626
3256 106
1265 1958
276 859
460 3181
709 321
691 256
76 697
336 502
309 601
292 437
267 712
276 556
492 281
100 719
3534 506
4081 1647
305 453
108 282
257 663
103 270
359 333
333 1083
4176 369
4177 307
574 121
115 487
1144 620
407 2007
329 420
334 3135
1435 256
417 321
884 280
336 620
1547 411
319 288
2518 900
439 442
361 425
3460 2592
588 104
84 675
571 117
1024 263
2090 115
281 403
634 110
102 256
1106 256
330 418
662 281
109 816
345 608
431 337
523 269
275 115
308 273
397 267
690 441
716 1855
1529 429
1594 272
740 278
108 290
362 447
1765 315
527 474
665 267
97 1146
2358 117
118 916
2533 3179
1774 293
392 1126
4228 295
1039 397
98 274
542 994
103 311
265 2015
261 515
832 1502
1068 636
285 467
386 1051
1871 324
586 724
409 315
315 284
388 1493
1167 491
690 309
1802 421
295 32
3723 440
309 312
100 294
266 504
398 1561
671 266
274 256
1106 258
2084 956
98 311
1653 510
356 604
101 879
116 978
539 10
2237 101
267 755
1823 694
705 968
2781 3368
4268 314
1302 940
525 349
650 10
108 977
276 263
320 312
1554 491
280 437
734 278
542 118
670 565
385 412
416 267
2341 355
1205 487
678 415
1481 76
3206 261
3272 109
292 436
358 383
2332 352
817 258
283 398
485 1537
372 114
79 1586
325 386
266 273
678 105
1401 2147
3117 644
1747 270
845 3220
105 430
720 267
3008 1342
425 309
2055 404
529 352
408 553
292 329
308 413
102 670
114 108
84 446
445 270
427 2239
4219 360
1762 265
2073 266
316 403
1084 326
1714 46
282 443
2102 283
267 77
276 545
2416 2822
685 325
961 1629
818 864
627 257
114 928
361 505
881 280
584 309
365 2241
329 1067
265 258
753 466
41 260
279 443
1964 315
258 509
286 111
781 284
396 1346
280 308
760 10
1077 399
1657 304
118 459
1183 293
269 1159
618 411
97 1957
401 1694
431 407
1916 32
292 1758
339 530
610 10
939 3197
291 257
1072 833
118 941
345 330
278 813
333 1139
806 451
275 657
1349 440
631 291
342 2040
643 391
364 122
1193 1515
1215 701
958 281
643 656
2588 836
1342 749
595 267
863 1660
2246 402
367 551
618 260
937 1953
884 257
2774 484
2661 320
275 941
284 263
735 288
345 754
628 485
1724 1187
1940 1093
861 846
568 555
857 1415
412 803
116 282
618 273
1811 615
84 114
336 386
1783 267
2148 534
83 320
786 10
793 266
101 822
1628 104
641 271
83 274
284 563
294 1466
314 454
504 1345
97 744
2327 466
544 622
291 263
1605 715
1617 1131
1035 313
315 2057
116 1253
786 642
645 335
669 402
391 331
337 1009
117 122
551 106
345 913
278 1650
117 99
1191 1282
336 425
291 273
705 116
418 111
627 325
265 1121
328 871
4149 268
1318 549
325 425
276 526
118 294
276 442
262 396
1508 10
341 114
2944 2319
116 264
787 526
276 968
336 505
690 10
901 853
525 524
1239 10
378 454
2756 284
592 957
430 271
759 257
1014 293
1583 340
319 475
104 3091
347 1176
114 446
100 526
320 278
264 326
408 371
2344 499
1723 256
71 295
3398 280
284 399
2547 258
1318 917
633 458
265 515
76 376
281 444
746 112
1750 421
286 349
854 354
330 573
438 100
269 472
429 1379
749 354
1355 1517
257 315
2452 1441
111 306
383 473
379 122
1722 536
115 264
424 346
753 513
2566 466
274 101
682 108
1499 267
118 572
632 309
2213 2213
465 351
343 275
73 1477
4520 1124
102 321
267 595
296 305
1274 385
276 351
450 1592
380 10
416 837
98 350
481 277
417 2431
2185 532
379 688
388 475
328 667
1890 423
993 376
679 2189
1271 267
434 609
116 454
122 257
108 312
468 1840
454 277
116 280
523 101
2079 73
862 114
544 263
2794 622
329 425
465 292
751 871
273 329
1539 1277
265 765
1744 257
296 3115
293 437
2209 851
416 10
286 941
346 1756
264 879
313 373
488 10
2842 483
559 313
276 719
450 257
78 850
257 383
309 607
3304 3969
393 563
679 1727
452 456
319 264
108 671
431 317
403 257
989 371
589 278
312 373
544 103
1722 820
4588 106
380 285
390 275
331 435
353 821
1318 564
1496 335
286 1880
71 4178
361 480
258 312
322 330
1801 277
290 353
392 349
1261 1128
2236 277
1173 1071
2077 497
2130 670
4608 678
257 429
581 2859
865 943
1002 261
1660 287
329 569
1576 1869
758 578
77 4092
416 4381
420 1649
1746 1131
1400 1420
77 1934
3994 863
4624 274
339 112
98 348
114 269
1016 2047
396 408
279 349
522 263
1819 1105
1291 510
1010 364
326 373
97 1115
305 4195
2629 1080
284 2492
1921 2180
555 309
828 280
66 2013
355 305
1701 402
4395 351
418 293
106 263
328 1334
898 291
625 256
1036 954
285 351
1274 441
397 278
1755 266
115 272
84 348
348 352
285 1260
2412 1114
392 102
331 267
268 651
618 10
410 101
540 309
575 277
80 1442
472 344
360 108
336 403
4317 364
574 114
112 343
659 563
1788 258
315 1119
754 786
587 258
299 412
1021 738
1101 316
65 1641
3052 99
1208 302
2315 484
275 751
1574 491
392 100
411 695
624 321
710 808
329 1290
1691 972
1191 263
548 1139
266 829
305 275
947 1798
1021 4347
1538 115
782 875
2289 694
1401 457
264 1007
394 383
326 346
1155 257
466 110
267 767
108 307
359 2840
1075 1295
97 382
1004 308
1214 1082
309 331
587 326
309 345
396 4068
1130 643
276 805
431 1532
403 448
114 309
97 340
283 614
416 260
313 519
1112 2274
3260 772
283 1419
406 520
929 866
862 499
2137 1070
322 291
103 2291
4476 834
711 386
381 708
291 609
285 722
278 316
271 347
2884 324
108 1659
282 433
310 515
575 331
1086 315
3909 267
465 723
2524 273
325 658
1464 277
396 588
359 270
313 331
2708 1285
420 1756
3542 3095
308 267
553 106
309 347
292 308
266 740
416 351
329 462
3543 938
763 429
485 529
346 835
1049 111
816 295
83 565
1303 1458
1112 10
376 267
831 994
277 2034
118 487
99 280
2908 271
2737 459
503 266
370 287
388 1637
1220 257
652 109
325 336
1129 321
322 1502
343 1785
109 325
318 258
261 102
372 2131
282 272
832 10
105 108
65 78
312 310
1205 261
63 788
1132 267
525 285
3172 284
305 416
406 658
860 351
301 1369
110 590
294 1942
276 657
1123 1553
557 2011
913 622
1101 480
78 105
82 360
4823 100
1086 309
1826 491
2015 258
104 619
356 1694
399 266
2393 32
858 1070
4043 3076
431 98
391 267
352 492
1025 524
1671 2006
686 992
65 381
329 1521
439 285
313 336
371 275
629 1275
1084 293
627 458
97 597
1388 394
397 271
303 418
273 437
257 448
709 261
265 257
2418 726
665 1735
1033 866
494 520
762 283
1859 315
407 578
329 708
423 373
316 1195
1597 257
398 276
1999 459
1086 351
515 1012
1469 430
309 616
97 1837
537 1755
660 1295
257 707
351 856
709 394
4073 2539
1218 1730
785 578
469 567
292 309
392 2956
322 1477
396 371
551 982
621 354
431 1680
84 320
787 293
576 260
110 749
535 575
276 598
314 442
314 547
495 500
303 101
257 2653
78 414
391 436
116 903
392 541
1073 277
305 772
379 836
358 258
411 257
3535 2166
1670 272
516 2771
1918 757
281 731
109 363
1254 279
1472 402
838 1748
1016 866
2270 3842
100 596
299 749
278 934
2854 361
2660 358
2491 2953
66 261
313 658
402 342
624 573
269 256
116 286
1467 379
2860 992
498 787
112 3468
292 424
69 120
4938 900
102 275
310 323
1612 267
286 837
301 286
3924 112
445 288
292 278
823 293
783 580
296 1466
269 261
3166 284
661 258
537 586
326 312
82 307
101 613
454 257
641 266
1594 355
337 845
1530 1443
3180 1590
291 268
1940 535
265 105
450 1260
2420 1071
371 1177
616 277
611 1463
495 293
629 397
801 331
310 1425
690 260
3074 441
437 315
336 540
479 1150
315 281
391 492
112 893
464 281
336 584
2573 109
398 282
398 972
2973 418
277 435
2405 550
1579 405
319 1635
341 671
561 402
382 1234
476 1661
1311 258
1529 326
571 101
714 1629
283 110
656 309
462 741
100 304
386 878
277 1842
629 926
1930 257
2261 534
979 651
102 807
735 99
439 520
266 386
383 308
524 351
519 1704
1301 330
4161 318
278 584
2336 271
1554 263
601 1607
108 1124
285 647
544 324
1451 767
412 413
278 872
305 106
588 382
108 514
710 567
279 376
488 326
309 1110
1011 580
291 368
870 364
1370 834
884 273
2977 466
263 273
3174 98
285 620
427 312
574 264
264 503
86 2019
2323 875
542 572
2543 99
320 336
823 433
383 292
889 258
3269 110
1220 361
385 267
336 419
320 257
797 312
669 385
1230 757
1666 293
1162 1225
1371 1284
100 472
106 1060
4251 284
1400 558
257 806
842 267
2027 1671
5075 552
67 721
378 105
3097 1404
1254 273
329 888
1733 258
936 373
3997 281
2070 529
100 545
537 4635
108 358
1775 655
332 429
472 1861
295 330
112 379
987 4500
355 3559
2092 371
347 4941
997 2018
330 118
415 256
2595 300
906 349
1411 259
382 846
339 317
268 122
269 273
823 280
973 2964
3338 321
357 309
3482 108
301 269
961 688
308 601
276 2187
114 612
684 685
426 590
281 1648
281 1175
737 346
537 417
617 114
591 399
2973 2091
290 349
1167 399
468 428
382 1044
4295 1326
329 632
331 2835
661 326
429 1416
1671 305
102 863
4047 280
419 1061
67 1512
3288 636
625 335
97 430
278 1620
339 381
492 409
301 105
1652 257
99 4209
437 351
322 2126
1691 417
257 2354
392 1648
276 1085
1421 268
956 10
2865 565
308 1227
663 266
589 1088
2090 114
387 565
368 267
342 568
827 1066
322 1506
5167 288
100 935
3077 316
407 1360
1156 257
408 2891
470 325
4458 272
264 530
347 256
1242 266
336 501
1156 570
100 1504
65 301
267 789
1243 694
1289 1319
1302 825
523 350
551 103
283 307
347 319
634 292
269 294
271 403
440 2069
1166 458
1840 734
843 451
257 821
118 833
295 99
1149 305
382 1159
558 300
345 2515
1129 258
2237 660
1489 271
355 441
2363 290
575 271
82 590
109 293
2482 2662
3824 986
1960 466
1642 340
1148 280
553 660
111 1133
558 674
774 273
440 2194
1539 340
488 591
346 817
115 1390
676 424
294 834
638 818
3736 510
506 1165
102 269
1049 272
98 411
1019 728
291 1044
724 258
84 272
1470 258
729 2096
4134 261
687 2205
434 1532
98 294
376 277
1616 2445
660 4777
90 4498
5248 798
3754 476
5250 804
1519 273
659 349
333 738
555 257